bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* 
 * Copyright(C) 2012 Robinson Mittmann. All Rights Reserved.
 * 
 * This file is part of the libstm32f.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation; either
 * version 3.0 of the License, or (at your option) any later version.
 * 
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 * 
 * You can receive a copy of the GNU Lesser General Public License from 
 * http://www.gnu.org/
 */

/** 
 * @file stm32f-rcc.h
 * @brief
 * @author Robinson Mittmann <bobmittmann@gmail.com>
 */ 

#ifndef __STM32F_RCC_H__
#define __STM32F_RCC_H__

/*-------------------------------------------------------------------------
  Reset and clock control (RCC)
  ------------------------------------------------------------------------- */

/* ------------------------------------------------------------------------- */
/* RCC clock control register */ 
#define STM32F_RCC_CR 0x00


/* PLLSAI clock ready flag */
#define RCC_PLLSAIRDY (1 << 29)
/* Set by hardware to indicate that the PLLI2S is locked.
   0: PLLSAI unlocked
   1: PLLSAI locked */

/* PLLSAI enable */
#define RCC_PLLSAION (1 << 28)
/* Set and cleared by software to enable PLLSAI.
   Cleared by hardware when entering Stop or Standby mode.
   0: PLLSAI OFF
   1: PLLSAI ON */

/* PLLI2S clock ready flag */
#define RCC_PLLI2SRDY (1 << 27)
/* Set by hardware to indicate that the PLLI2S is locked.
   0: PLLI2S unlocked
   1: PLLI2S locked */

/* PLLI2S enable */
#define RCC_PLLI2SON (1 << 26)
/* Set and cleared by software to enable PLLI2S.
   Cleared by hardware when entering Stop or Standby mode.
   0: PLLI2S OFF
   1: PLLI2S ON */

/* Main PLL (PLL) clock ready flag */
#define RCC_PLLRDY (1 << 25)
/* Set by hardware to indicate that PLL is locked.
   0: PLL unlocked
   1: PLL locked */

/* Main PLL (PLL) enable */
#define RCC_PLLON (1 << 24)
/* Set and cleared by software to enable PLL.
   Cleared by hardware when entering Stop or Standby mode. This bit 
   cannot be reset if PLL clock is used as the system clock.
   0: PLL OFF
   1: PLL ON */

/* Clock security system enable */
#define RCC_CSSON (1 << 19)
/* Set and cleared by software to enable the clock security system. When 
   CSSON is set, the clock detector is enabled by hardware when the HSE 
   oscillator is ready, and disabled by hardware if an oscillator failure 
   is detected.
   0: Clock security system OFF (Clock detector OFF)
   1: Clock security system ON (Clock detector ON if HSE oscillator is 
   stable, OFF if not) */

/* HSE clock bypass */
#define RCC_HSEBYP (1 << 18)
/* Set and cleared by software to bypass the oscillator with an external 
   clock. The external clock must be enabled with the HSEON bit, to 
   be used by the device.
   The HSEBYP bit can be written only if the HSE oscillator is disabled.
   0: HSE oscillator not bypassed
   1: HSE oscillator bypassed with an external clock */

/* HSE clock ready flag */
#define RCC_HSERDY (1 << 17)
/* Set by hardware to indicate that the HSE oscillator is stable. After 
   the HSION bit is cleared, HSERDY goes low after 6 HSE oscillator 
   clock cycles.
   0: HSE oscillator not ready
   1: HSE oscillator ready */

/* HSE clock enable */
#define RCC_HSEON (1 << 16)
/* Set and cleared by software.
   Cleared by hardware to stop the HSE oscillator when entering Stop or 
   Standby mode. This bit cannot be reset if the HSE oscillator is used 
   directly or indirectly as the system clock.
   0: HSE oscillator OFF
   1: HSE oscillator ON */

/* Internal high-speed clock calibration */
#define RCC_HSICAL (0xff << 8)
/* These bits are initialized automatically at startup. */

/* Internal high-speed clock trimming */
#define RCC_HSITRIM (0x1f << 3)
/* These bits provide an additional user-programmable trimming value that 
   is added to the HSICAL[7:0] bits. It can be programmed to adjust to 
   variations in voltage and temperature that influence the frequency of 
   the internal HSI RC. */

/* Bit 2 Reserved, always read as 0. */

/* Internal high-speed clock ready flag */
#define RCC_HSIRDY (1 << 1)
/* Set by hardware to indicate that the HSI oscillator is stable. After the 
   HSION bit is cleared, HSIRDY goes low after 6 HSI clock cycles.
   0: HSI oscillator not ready
   1: HSI oscillator ready */

/* Internal high-speed clock enable */
#define RCC_HSION (1 << 0)
/* Set and cleared by software.
   Set by hardware to force the HSI oscillator ON when leaving the Stop 
   or Standby mode or in case of a failure of the HSE oscillator used 
   directly or indirectly as the system clock. This bit cannot be cleared 
   if the HSI is used directly or indirectly as the system clock.
   0: HSI oscillator OFF
   1: HSI oscillator ON */

#if defined(STM32F2X) || defined(STM32F4X)
/* ------------------------------------------------------------------------- */
/* RCC PLL configuration register */
#define STM32F_RCC_PLLCFGR 0x04

#define RCC_PLLR_MASK (0x7 << 28)
#define RCC_PLLR(Q) (((Q) & 0x7) << 28)
/* Main PLL division factor for I2Ss, SAIs, SYSTEM and SPDIF-Rx clocks
   Set and cleared by software to control the frequency of the clock. These 
   bits should be written only if PLL is disabled.
   Clock frequency = VCO frequency / PLLR with 2 ≤ PLLR ≤ 7
   000: PLLR = 0, wrong configuration
   001: PLLR = 1, wrong configuration
   010: PLLR = 2
   011: PLLR = 3
   ...
   111: PLLR = 7 */

#define RCC_PLLQ_MASK (0xf << 24)
#define RCC_PLLQ(Q) (((Q) & 0xf) << 24)
/* Main PLL (PLL) division factor for USB OTG FS, SDIO and random number 
   generator clocks Set and cleared by software to control the frequency 
   of USB OTG FS clock, the random number generator clock and the SDIO 
   clock. These bits should be written only if PLL is disabled.
   Caution: The USB OTG FS requires a 48 MHz clock to work correctly. The 
   SDIO and the random number generator need a frequency lower than or 
   equal to 48 MHz to work correctly.
   USB OTG FS clock frequency = VCO frequency / PLLQ with 4 <= PLLQ <= 15
   0000: PLLQ = 0, wrong configuration
   ...
   0011: PLLQ = 3, wrong configuration
   0100: PLLQ = 4
   0101: PLLQ = 5
   ...
   1111: PLLQ = 15 */

/* Bit 23 Reserved, always read as 0. */

#define RCC_PLLSRC (1 << 22)
#define RCC_PLLSRC_HSI (0 << 22)
#define RCC_PLLSRC_HSE (1 << 22)
/* Main PLL(PLL) and audio PLL (PLLI2S) entry clock source Set and 
   cleared by software to select PLL and PLLI2S clock source. This bit 
   can be written only when PLL and PLLI2S are disabled.
   0: HSI clock selected as PLL and PLLI2S clock entry
   1: HSE oscillator clock selected as PLL and PLLI2S clock entr */

#define RCC_PLLP_MASK (0x3 << 16)
#define RCC_PLLP(P) (((((P) >> 1) - 1)  & 0x3) << 16)
#define RCC_PLLP_2 (0x0 << 16)
#define RCC_PLLP_4 (0x1 << 16)
#define RCC_PLLP_6 (0x2 << 16)
#define RCC_PLLP_8 (0x3 << 16)
/* Main PLL (PLL) division factor for main system clock Set and cleared by 
   software to control the frequency of the general PLL output clock. These 
   bits can be written only if PLL is disabled.
   Caution: The software has to set these bits correctly not to exceed 
   120 MHz on this domain.
   PLL output clock frequency = VCO frequency / PLLP with PLLP = 2, 4, 6, or 8
   00: PLLP = 2
   01: PLLP = 4
   10: PLLP = 6
   11: PLLP = 8 */

#define RCC_PLLN_MASK (0x1ff << 6)
#define RCC_PLLN(N) (((N) & 0x1ff) << 6)
/* Main PLL (PLL) multiplication factor for VCO Set and cleared by software 
   to control the multiplication factor of the VCO. These bits can be 
   written only when PLL is disabled. Only half-word and word accesses are 
   allowed to write these bits.
   Caution: The software has to set these bits correctly to ensure that the 
   VCO output frequency is between 192 and 432 MHz.
   VCO output frequency = VCO input frequency × PLLN with 192 ≤ PLLN ≤ 432
   000000000: PLLN = 0, wrong configuration
   000000001: PLLN = 1, wrong configuration
   ...
   011000000: PLLN = 192
   011000001: PLLN = 193
   011000010: PLLN = 194
   ...
   110110000: PLLN = 432
   110110000: PLLN = 433, wrong configuration
   ...
   111111111: PLLN = 511, wrong configuration */

