bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
#define RCC_PLLM_MASK (0x1f << 0)
#define RCC_PLLM(M) (((M) & 0x1f) << 0)
/* Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock
   Set and cleared by software to divide the PLL and PLLI2S input clock 
   before the VCO. These bits can be written only when the PLL and PLLI2S 
   are disabled. Caution: The software has to set these bits correctly to 
   ensure that the VCO input frequency ranges from 1 to 2 MHz. It is 
   recommended to select a frequency of 2 MHz to limit PLL jitter.
   VCO input frequency = PLL input clock frequency / PLLM with 2 ≤ PLLM ≤ 63
   000000: PLLM = 0, wrong configuration
   000001: PLLM = 1, wrong configuration
   000010: PLLM = 2
   000011: PLLM = 3
   000100: PLLM = 4
   ...
   111110: PLLM = 62
   111111: PLLM = 63 */

#endif /* defined(STM32F2X) || defined(STM32F4X) */



/* ------------------------------------------------------------------------- */
/* RCC clock configuration register */

#if defined(STM32F1X) || defined(STM32F3X)

/* STM32F10x RCC clock configuration register */
#define STM32F_RCC_CFGR 0x04


#if defined(STM32F3X)

/* PLLNODIV: Do not divide PLL to MCO 
   (in STM32F303x6/8 and STM32F328x8 , STM32F303xDxE and STM32F398xE only) */
#define RCC_PLLNODIV   (1 << 31)

#define RCC_MCOPRE     (0x7 << 28)
#define RCC_MCOPRE_1   (0x0 << 28)
#define RCC_MCOPRE_2   (0x1 << 28)
#define RCC_MCOPRE_4   (0x2 << 28)
#define RCC_MCOPRE_8   (0x3 << 28)
#define RCC_MCOPRE_16  (0x4 << 28)
#define RCC_MCOPRE_32  (0x5 << 28)
#define RCC_MCOPRE_64  (0x6 << 28)
#define RCC_MCOPRE_128 (0x7 << 28)

#endif

/* Microcontroller Clock Output Flag */
#define RCC_MCOF       (1 << 28)
/* MCOF: Microcontroller Clock Output Flag
   Set and reset by hardware.
   It is reset by hardware when MCO field is written with a new value
   It is set by hardware when the switch to the new MCO source is effective. */

/* Bits 26:24 MCO: Microcontroller clock output */
#define RCC_MCO_OFF    (0x0 << 24)
#define RCC_MCO_LSI    (0x2 << 24)
#define RCC_MCO_LSE    (0x3 << 24)
#define RCC_MCO_SYSCLK (0x4 << 24)
#define RCC_MCO_HSI    (0x5 << 24)
#define RCC_MCO_HSE    (0x6 << 24)
#define RCC_MCO_PLL    (0x7 << 24)
/* Set and cleared by software.
   000: MCO output disabled, no clock on MCO
   001: Reserved
   010: LSI clock selected.
   011: LSE clock selected.
   100: System clock (SYSCLK) selected
   101: HSI clock selected
   110: HSE clock selected
   111: PLL clock divided by 2 selected
   Note: This clock output may have some truncated cycles at startup or 
   during MCO clock source switching. */

/* Bit 23 I2SSRC: I2S external clock source selection */
#define RCC_I2SSRC    (1 << 23)
/* Set and reset by software to clock I2S2 and I2S3 with an external 
   clock. This bits must be valid before enabling I2S2-3 clocks.
   0: I2S2 and I2S3 clocked by system clock
   1: I2S2 and I2S3 clocked by the external clock */

/* Bit 22 USBPRE: USB prescaler */
#define RCC_USBPRE       (1 << 22)
#define RCC_USBPRE_1     (1 << 22)
#define RCC_USBPRE_1DOT5 (0 << 22)
/* Set and reset by software to generate 48 MHz USB clock. These bits must 
   be valid before enabling USB clocks.
   0: PLL clock is divided by 1.5
   1: PLL clock is not divided */

/* Bits 21:18 PLLMUL: PLL multiplication factor */
#define RCC_PLLMUL_MASK   (0x0f << 18)
#define RCC_PLLMUL(M)     ((((M) - 2) & 0x0f) << 18)

/* Bit 17 PLLXTPRE: HSE divider for PLL input clock */
#define RCC_PLLXTPRE      (1 << 17)
/* This bits is set and cleared by software to select the HSE division 
   factor for the PLL. It can be written only when the PLL is disabled.
   Note: This bit is the same as the LSB of PREDIV in Clock 
   configuration register 2 (RCC_CFGR2) (for compatibility with 
   other STM32 products)
   0000: HSE input to PLL not divided
   0001: HSE input to PLL divided by 2 */

#if defined(STM32F3X)
/* PLLSRC: PLL entry clock source (STM32F303xD/E and STM32F398xE only) */
#define RCC_PLLSRC       (3 << 15)
#define RCC_PLLSRC_HSI_2 (0 << 15)
#define RCC_PLLSRC_HSI   (1 << 15)
#define RCC_PLLSRC_HSE   (2 << 15)
/* Set and cleared by software to select PLL clock source. 
   These bits can be written only when PLL is disabled.
   00: HSI/2 used as PREDIV1 entry and PREDIV1 forced to div by 2.
   01: HSI used as PREDIV1 entry.
   10: HSE used as PREDIV1 entry.
   11: Reserved. */
#endif

#if defined(STM32F1X)
/* Bit 16 PLLSRC: PLL entry clock source */
#define RCC_PLLSRC     (1 << 16)
#define RCC_PLLSRC_HSI (0 << 16)
#define RCC_PLLSRC_HSE (1 << 16)

#define RCC_ADCPRE   (0x3 << 14)
#define RCC_ADCPRE_2 (0x0 << 14)
#define RCC_ADCPRE_4 (0x1 << 14)
#define RCC_ADCPRE_6 (0x2 << 14)
#define RCC_ADCPRE_8 (0x3 << 14)
#endif

/* Bits 13:11 PPRE2: APB high-speed prescaler (APB2) */
#define RCC_PPRE2    (0x7 << 11)
#define RCC_PPRE2_1  (0x0 << 11)
#define RCC_PPRE2_2  (0x4 << 11)
#define RCC_PPRE2_4  (0x5 << 11)
#define RCC_PPRE2_8  (0x6 << 11)
#define RCC_PPRE2_16 (0x7 << 11)
#define RCC_PPRE2_GET(CFGR) (((CFGR) >> 11) 0x7)

/* Bits 10:8 PPRE1:APB Low-speed prescaler (APB1) */
#define RCC_PPRE1    (0x7 << 8)
#define RCC_PPRE1_1  (0x0 << 8)
#define RCC_PPRE1_2  (0x4 << 8)
#define RCC_PPRE1_4  (0x5 << 8)
#define RCC_PPRE1_8  (0x6 << 8)
#define RCC_PPRE1_16 (0x7 << 8)
#define RCC_PPRE1_GET(CFGR) (((CFGR) >> 8) 0x7)


#elif defined(STM32F2X) || defined(STM32F4X)

#define STM32F_RCC_CFGR 0x08

/* Microcontroller clock output 2 */
#define RCC_MCO2 (0x3 << 30)
#define RCC_MCO2_SYSCLK (0x0 << 30)
#define RCC_MCO2_PLLI2S (0x1 << 30)
#define RCC_MCO2_HSE    (0x2 << 30)
#define RCC_MCO2_PLL    (0x3 << 30)
/* Set and cleared by software. Clock source selection may generate glitches 
   on MCO2. It is highly recommended to configure these bits only after reset 
   before enabling the external oscillators and the PLLs.
   00: System clock (SYSCLK) selected
   01: PLLI2S clock selected
   10: HSE oscillator clock selected
   11: PLL clock selected */

/* MCO2 prescaler */
#define RCC_MCO2PRE (0x7 << 27)
#define RCC_MCO2PRE_1 (0x0 << 27)
#define RCC_MCO2PRE_2 (0x4 << 27)
#define RCC_MCO2PRE_3 (0x5 << 27)
#define RCC_MCO2PRE_4 (0x6 << 27)
#define RCC_MCO2PRE_5 (0x7 << 27)
/* Set and cleared by software to configure the prescaler of the MCO2. 
   Modification of this prescaler may generate glitches on MCO2. It is 
   highly recommended to change this prescaler only after reset before 
   enabling the external oscillators and the PLLs.
   0xx: no division
   100: division by 2
   101: division by 3
   110: division by 4
   111: division by 5 */

/* MCO1 prescaler */
#define RCC_MCO1PRE (0x7 << 24)
#define RCC_MCO1PRE_1 (0x0 << 24)
#define RCC_MCO1PRE_2 (0x4 << 24)
#define RCC_MCO1PRE_3 (0x5 << 24)
#define RCC_MCO1PRE_4 (0x6 << 24)
#define RCC_MCO1PRE_5 (0x7 << 24)
/* Set and cleared by software to configure the prescaler of the MCO1. 
   Modification of this prescaler may generate glitches on MCO1. It is 
   highly recommended to change this prescaler only after reset before 
   enabling the external oscillators and the PLL.
   0xx: no division
   100: division by 2
   101: division by 3
   110: division by 4
   111: division by 5 */

/* I2S clock selection */
#define RCC_I2SSRC (1 << 23)
/* Set and cleared by software. This bit allows to select the I2S clock 
   source between the PLLI2S clock and the external clock. It is highly 
   recommended to change this bit only after reset and before enabling 
   the I2S module.
   0: PLLI2S clock used as I2S clock source
   1: External clock mapped on the I2S_CKIN pin used as I2S clock source */

/* Microcontroller clock output 1 */
#define RCC_MCO1 (0x3 << 21)
#define RCC_MCO1_HSI (0x0 << 21)
#define RCC_MCO1_LSE (0x1 << 21)
#define RCC_MCO1_HSE (0x2 << 21)
#define RCC_MCO1_PLL (0x3 << 21)
/* Set and cleared by software. Clock source selection may generate glitches 
   on MCO1. It is highly recommended to configure these bits only after reset 
   before enabling the external oscillators and PLL.
   00: HSI clock selected
   01: LSE oscillator selected
   10: HSE oscillator clock selected
   11: PLL clock selected */

/* HSE division factor for RTC clock */
#define RCC_RTCPRE (0x1f << 16)
/* Set and cleared by software to divide the HSE clock input clock to 
   generate a 1 MHz clock for RTC.
   Caution: The software has to set these bits correctly to ensure that the 
   clock supplied to the RTC is 1 MHz. These bits must be configured if 
   needed before selecting the RTC clock source.
   00000: no clock
   00001: no clock
   00010: HSE/2
   00011: HSE/3
   00100: HSE/4
   ...
   11110: HSE/30
   11111: HSE/31 */

/* APB high-speed prescaler (APB2) */
#define RCC_PPRE2 (0x7 << 13)
#define RCC_PPRE2_1 (0x0 << 13)
#define RCC_PPRE2_2 (0x4 << 13)
#define RCC_PPRE2_4 (0x5 << 13)
#define RCC_PPRE2_8 (0x6 << 13)
#define RCC_PPRE2_16 (0x7 << 13)
#define RCC_PPRE2_GET(CFGR) (((CFGR) >> 13) 0x7)
/* Set and cleared by software to control APB high-speed clock division factor.
   Caution: The software has to set these bits correctly not to exceed 
   60 MHz on this domain.
   The clocks are divided with the new prescaler factor from 1 to 16 AHB 
   cycles after PPRE2 write.
   0xx: AHB clock not divided
   100: AHB clock divided by 2
   101: AHB clock divided by 4
   110: AHB clock divided by 8
   111: AHB clock divided by 16 */

