bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* APB Low speed prescaler (APB1) */
#define RCC_PPRE1 (0x7 << 10)
#define RCC_PPRE1_1 (0x0 << 10)
#define RCC_PPRE1_2 (0x4 << 10)
#define RCC_PPRE1_4 (0x5 << 10)
#define RCC_PPRE1_8 (0x6 << 10)
#define RCC_PPRE1_16 (0x7 << 10)
#define RCC_PPRE1_GET(CFGR) (((CFGR) >> 10) 0x7)
/* Set and cleared by software to control APB low-speed clock division factor.
   Caution: The software has to set these bits correctly not to exceed 
   30 MHz on this domain.
   The clocks are divided with the new prescaler factor from 1 to 16 
   AHB cycles after PPRE1 write.
   0xx: AHB clock not divided
   100: AHB clock divided by 2
   101: AHB clock divided by 4
   110: AHB clock divided by 8
   111: AHB clock divided by 16 */

#endif /* STM32F1X, STM32F3X */

/* AHB prescaler */
#define RCC_HPRE (0xf << 4)
#define RCC_HPRE_1 (0x0 << 4)
#define RCC_HPRE_2 (0x8 << 4)
#define RCC_HPRE_4 (0x9 << 4)
#define RCC_HPRE_8 (0xa << 4)
#define RCC_HPRE_16 (0xb << 4)
#define RCC_HPRE_64 (0xc << 4)
#define RCC_HPRE_128 (0xd << 4)
#define RCC_HPRE_256 (0xe << 4)
#define RCC_HPRE_512 (0xf << 4)
#define RCC_HPRE_GET(CFGR) (((CFGR) >> 4) 0xf)
/* Set and cleared by software to control AHB clock division factor.
   Caution: The clocks are divided with the new prescaler factor from 1 
   to 16 AHB cycles after HPRE write.
   Caution: The AHB clock frequency must be at least 25 MHz when the 
   Ethernet is used.
   0xxx: system clock not divided
   1000: system clock divided by 2
   1001: system clock divided by 4
   1010: system clock divided by 8
   1011: system clock divided by 16
   1100: system clock divided by 64
   1101: system clock divided by 128
   1110: system clock divided by 256
   1111: system clock divided by 512 */

/* System clock switch status. */
#define RCC_SWS (0x3 << 2)
#define RCC_SWS_HSI (0x0 << 2)
#define RCC_SWS_HSE (0x1 << 2)
#define RCC_SWS_PLL (0x2 << 2)
/* Set and cleared by hardware to indicate which 
   clock source is used as the system clock.
   00: HSI oscillator used as the system clock
   01: HSE oscillator used as the system clock
   10: PLL used as the system clock
   11: not applicable */

/* System clock switch */
#define RCC_SW (0x3 << 0)
#define RCC_SW_HSI (0x0 << 0)
#define RCC_SW_HSE (0x1 << 0)
#define RCC_SW_PLL (0x2 << 0)
/* Set and cleared by software to select the system clock source.
   Set by hardware to force the HSI selection when leaving the Stop or 
   Standby mode or in case of failure of the HSE oscillator used directly or 
   indirectly as the system clock.
   00: HSI oscillator selected as system clock
   01: HSE oscillator selected as system clock
   10: PLL selected as system clock
   11: not allowed */



#if defined(STM32F2X) || defined(STM32F4X)

/* ------------------------------------------------------------------------- */
/* RCC AHB1 peripheral clock register */
#define STM32F_RCC_AHB1ENR 0x30

#define RCC_OTGHSULPI   30
#define RCC_OTGHS       29
#define RCC_ETHMACPTP   28
#define RCC_ETHMACRX    27
#define RCC_ETHMACTX    26
#define RCC_ETHMAC      25
#define RCC_DMA2D       23
#define RCC_DMA2        22
#define RCC_DMA1        21
#define RCC_CCMDATARAM  20
#define RCC_BKPSRAM     18
#define RCC_CRC         12
#define RCC_GPIOK       10
#define RCC_GPIOJ        9
#define RCC_GPIOI        8
#define RCC_GPIOH        7
#define RCC_GPIOG        6
#define RCC_GPIOF        5
#define RCC_GPIOE        4
#define RCC_GPIOD        3
#define RCC_GPIOC        2
#define RCC_GPIOB        1
#define RCC_GPIOA        0

/* USB OTG HSULPI clock enable */
#define RCC_OTGHSULPIEN (1 << 30)
/* Set and cleared by software.
   0: USB OTG HS ULPI clock disabled
   1: USB OTG HS ULPI clock enabled */

/* USB OTG HS clock enable */
#define RCC_OTGHSEN (1 << 29)
/* Set and cleared by software.
   0: USB OTG HS clock disabled
   1: USB OTG HS clock enabled */

/* Ethernet PTP clock enable */
#define RCC_ETHMACPTPEN (1 << 28)
/* Set and cleared by software.
   0: Ethernet PTP clock disabled
   1: Ethernet PTP clock enabled */

/* Ethernet Reception clock enable */
#define RCC_ETHMACRXEN (1 << 27)
/* Set and cleared by software.
   0: Ethernet Reception clock disabled
   1: Ethernet Reception clock enabled */

/* Ethernet Transmission clock enable */
#define RCC_ETHMACTXEN (1 << 26)
/* Set and cleared by software.
   0: Ethernet Transmission clock disabled
   1: Ethernet Transmission clock enabled */

/* Ethernet MAC clock enable */
#define RCC_ETHMACEN (1 << 25)
/* Set and cleared by software.
   0: Ethernet MAC clock disabled
   1: Ethernet MAC clock enabled */

/* Bits 24:23 Reserved, always read as 0. */

/* DMA2 clock enable */
#define RCC_DMA2EN (1 << 22)
/* Set and cleared by software.
   0: DMA2 clock disabled
   1: DMA2 clock enabled */

/* DMA1 clock enable */
#define RCC_DMA1EN (1 << 21)
/* Set and cleared by software.
   0: DMA1 clock disabled
   1: DMA1 clock enabled */

/* CCMDATARAM clock enable */
#define RCC_CCMDATARAMEN (1 << 20)
/* Set and cleared by software.
   0: CCMDATARAM clock disabled
   1: CCMDATARAM clock enabled */

/* Bits 20:19 Reserved, always read as 0. */

/* Backup SRAM interface clock enable */
#define RCC_BKPSRAMEN (1 << 18)
/* Set and cleared by software.
   0: Backup SRAM interface clock disabled
   1: Backup SRAM interface clock enabled */

/* Bits 17:13 Reserved, always read as 0. */

/* CRC clock enable */
#define RCC_CRCEN (1 << 12)
/* Set and cleared by software.
   0: CRC clock disabled
   1: CRC clock enabled */

/* Bits 11:9 Reserved, always read as 0. */

/* IO port I clock enable */
#define RCC_GPIOIEN (1 << 8)
/* Set and cleared by software.
   0: IO port I clock disabled
   1: IO port I clock enabled */

/* IO port H clock enable */
#define RCC_GPIOHEN (1 << 7)
/* Set and cleared by software.
   0: IO port H clock disabled
   1: IO port H clock enabled */

/* IO port G clock enable */
#define RCC_GPIOGEN (1 << 6)
/* Set and cleared by software.
   0: IO port G clock disabled
   1: IO port G clock enabled */

/* IO port F clock enable */
#define RCC_GPIOFEN (1 << 5)
/* Set and cleared by software.
   0: IO port F clock disabled
   1: IO port F clock enabled */

/* IO port E clock enable */
#define RCC_GPIOEEN (1 << 4)
/* Set and cleared by software.
   0: IO port E clock disabled
   1: IO port E clock enabled */

/* IO port D clock enable */
#define RCC_GPIODEN (1 << 3)
/* Set and cleared by software.
   0: IO port D clock disabled
   1: IO port D clock enabled */

/* IO port C clock enable */
#define RCC_GPIOCEN (1 << 2)
/* Set and cleared by software.
   0: IO port C clock disabled
   1: IO port C clock enabled */

/* IO port B clock enable */
#define RCC_GPIOBEN (1 << 1)
/* Set and cleared by software.
   0: IO port B clock disabled
   1: IO port B clock enabled */

/* IO port A clock enable */
#define RCC_GPIOAEN (1 << 0)
/* Set and cleared by software.
   0: IO port A clock disabled
   1: IO port A clock enabled */


/* ------------------------------------------------------------------------- */
/* RCC AHB2 peripheral clock enable register */
#define STM32F_RCC_AHB2ENR 0x34

#define RCC_OTGFS 7
#define RCC_RNG   6
#define RCC_HASH  5
#define RCC_CRYP  4
#define RCC_DCMI  0

