bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 7 - USB OTG FS clock enable */
#define RCC_OTGFSEN (1 << 7)
/* Set and cleared by software.
   0: USB OTG FS clock disabled
   1: USB OTG FS clock enabled */

/* Bit 6 - Random number generator clock enable */
#define RCC_RNGEN (1 << 6)
/* Set and cleared by software.
   0: Random number generator clock disabled
   1: Random number generator clock enabled */

/* Bit 5 - Hash modules clock enable */
#define RCC_HASHEN (1 << 5)
/* Set and cleared by software.
   0: Hash modules clock disabled
   1: Hash modules clock enabled */

/* Bit 4 - Cryptographic modules clock enable */
#define RCC_CRYPEN (1 << 4)
/* Set and cleared by software.
   0: cryptographic module clock disabled
   1: cryptographic module clock enabled */

/* Bit 0 - Camera interface enable */
#define RCC_DCMIEN (1 << 0)
/* Set and cleared by software.
   0: Camera interface clock disabled
   1: Camera interface clock enabled */


/* ------------------------------------------------------------------------- */
/* RCC AHB3 peripheral clock enable register */
#define STM32F_RCC_AHB3ENR 0x38

#define RCC_FSMC 0
#define RCC_QSPI 1

/* Bit 0 - Flexible static memory controller module clock enable */
#define RCC_FSMCEN (1 << 0)
/* Set and cleared by software.
   0: FSMC module clock disabled
   1: FSMC module clock enabled */

/* Bit 1 - QuadSPI memory controller module clock enable */
#define RCC_QSPIEN (1 << 0)
/* Set and cleared by software.
   0: QSPI module clock disabled
   1: QSPI module clock enabled */

/* ------------------------------------------------------------------------- */
/* RCC APB1 peripheral clock enable register */
#define STM32F_RCC_APB1ENR 0x40

#define RCC_UART8   31
#define RCC_UART7   30
#define RCC_DAC     29
#define RCC_PWR     28
#define RCC_CEC     27
#define RCC_CAN2    26
#define RCC_CAN1    25
#define RCC_FMPI2C1 24
#define RCC_I2C3    23
#define RCC_I2C2    22
#define RCC_I2C1    21
#define RCC_UART5   20
#define RCC_UART4   19
#define RCC_USART3  18
#define RCC_USART2  17
#define RCC_SPI3    15
#define RCC_SPI2    14
#define RCC_WWDG    11
#define RCC_TIM14    8
#define RCC_TIM13    7
#define RCC_TIM12    6
#define RCC_TIM7     5
#define RCC_TIM6     4
#define RCC_TIM5     3
#define RCC_TIM4     2
#define RCC_TIM3     1
#define RCC_TIM2     0

/* Bit 29 - DAC interface clock enable */
#define RCC_DACEN (1 << 29)
/* Set and cleared by software.
   0: DAC interface clock disabled
   1: DAC interface clock enable */

/* Bit 28 - Power interface clock enable */
#define RCC_PWREN (1 << 28)
/* Set and cleared by software.
   0: Power interface clock disabled
   1: Power interface clock enable */

/* Bit 27 - CEC interface clock enable */
#define RCC_CECEN (1 << 27)
/* Set and cleared by software.
   0: CEC interface clock disabled
   1: CEC interface clock enable */

/* Bit 26 - CAN 2 clock enable */
#define RCC_CAN2EN (1 << 26)
/* Set and cleared by software.
   0: CAN 2 clock disabled
   1: CAN 2 clock enabled */

/* Bit 25 - CAN 1 clock enable */
#define RCC_CAN1EN (1 << 25)
/* Set and cleared by software.
   0: CAN 1 clock disabled
   1: CAN 1 clock enabled */

/* Bit 24 - FMPI2C1 clock enable */
#define RCC_FMPI2C1EN (1 << 24)
/* Set and cleared by software.
   0: FMPI2C1 1 clock disabled
   1: FMPI2C1 1 clock enabled */

/* Bit 23 - I2C3 clock enable */
#define RCC_I2C3EN (1 << 23)
/* Set and cleared by software.
   0: I2C3 clock disabled
   1: I2C3 clock enabled */

/* Bit 22 - I2C2 clock enable */
#define RCC_I2C2EN (1 << 22)
/* Set and cleared by software.
   0: I2C2 clock disabled
   1: I2C2 clock enabled */

/* Bit 21 - I2C1 clock enable */
#define RCC_I2C1EN (1 << 21)
/* Set and cleared by software.
   0: I2C1 clock disabled
   1: I2C1 clock enabled */

/* Bit 20 - UART5 clock enable */
#define RCC_UART5EN (1 << 20)
/* Set and cleared by software.
   0: UART5 clock disabled
   1: UART5 clock enabled */

/* Bit 19 - UART4 clock enable */
#define RCC_UART4EN (1 << 19)
/* Set and cleared by software.
   0: UART4 clock disabled
   1: UART4 clock enabled */

/* Bit 18 - USART3 clock enable */
#define RCC_USART3EN (1 << 18)
/* Set and cleared by software.
   0: USART3 clock disabled
   1: USART3 clock enabled */

/* Bit 17 - USART 2 clock enable */
#define RCC_USART2EN (1 << 17)
/* Set and cleared by software.
   0: USART2 clock disabled
   1: USART2 clock enabled */

/* Bit 15 - SPI3 clock enable */
#define RCC_SPI3EN (1 << 15)
/* Set and cleared by software.
   0: SPI3 clock disabled
   1: SPI3 clock enabled */

/* Bit 14 - SPI2 clock enable */
#define RCC_SPI2EN (1 << 14)
/* Set and cleared by software.
   0: SPI2 clock disabled
   1: SPI2 clock enabled */

/* Bit 11 - Window watchdog clock enable */
#define RCC_WWDGEN (1 << 11)
/* Set and cleared by software.
   0: Window watchdog clock disabled
   1: Window watchdog clock enabled */

/* Bit 8 - TIM14 clock enable */
#define RCC_TIM14EN (1 << 8)
/* Set and cleared by software.
   0: TIM14 clock disabled
   1: TIM14 clock enabled */

/* Bit 7 - TIM13 clock enable */
#define RCC_TIM13EN (1 << 7)
/* Set and cleared by software.
   0: TIM13 clock disabled
   1: TIM13 clock enabled */

/* Bit 6 - TIM12 clock enable */
#define RCC_TIM12EN (1 << 6)
/* Set and cleared by software.
   0: TIM12 clock disabled
   1: TIM12 clock enabled */

/* Bit 5 - TIM7 clock enable */
#define RCC_TIM7EN (1 << 5)
/* Set and cleared by software.
   0: TIM7 clock disabled
   1: TIM7 clock enabled */

/* Bit 4 - TIM6 clock enable */
#define RCC_TIM6EN (1 << 4)
/* Set and cleared by software.
   0: TIM6 clock disabled
   1: TIM6 clock enabled */

/* Bit 3 - TIM5 clock enable */
#define RCC_TIM5EN (1 << 3)
/* Set and cleared by software.
   0: TIM5 clock disabled
   1: TIM5 clock enabled */

/* Bit 2 - TIM4 clock enable */
#define RCC_TIM4EN (1 << 2)
/* Set and cleared by software.
   0: TIM4 clock disabled
   1: TIM4 clock enabled */

/* Bit 1 - TIM3 clock enable */
#define RCC_TIM3EN (1 << 1)
/* Set and cleared by software.
   0: TIM3 clock disabled
   1: TIM3 clock enabled */

