bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 0 - TIM2 clock enable */
#define RCC_TIM2EN (1 << 0)
/* Set and cleared by software.
   0: TIM2 clock disabled
   1: TIM2 clock enabled */


/* ------------------------------------------------------------------------- */
/* RCC APB2 peripheral clock enable register */
#define STM32F_RCC_APB2ENR 0x44

#define RCC_LTDC   26
#define RCC_SAI2   23
#define RCC_SAI1   22
#define RCC_SPI6   21
#define RCC_SPI5   20
#define RCC_TIM11  18
#define RCC_TIM10  17
#define RCC_TIM9   16
#define RCC_SYSCFG 14
#define RCC_SPI4   13
#define RCC_SPI1   12
#define RCC_SDIO   11
#define RCC_ADC3   10
#define RCC_ADC2    9
#define RCC_ADC1    8
#define RCC_USART6  5
#define RCC_USART1  4
#define RCC_TIM8    1
#define RCC_TIM1    0

/* Bit 23 - SAI2 clock enable */
#define RCC_SAI2EN (1 << 23)
/* Set and cleared by software.
   0: SAI2 clock disabled
   1: SAI2 clock enabled */

/* Bit 22 - SAI1 clock enable */
#define RCC_SAI1EN (1 << 22)
/* Set and cleared by software.
   0: SAI1 clock disabled
   1: SAI1 clock enabled */

/* Bit 18 - TIM11 clock enable */
#define RCC_TIM11EN (1 << 18)
/* Set and cleared by software.
   0: TIM11 clock disabled
   1: TIM11 clock enabled */

/* Bit 17 - TIM10 clock enable */
#define RCC_TIM10EN (1 << 17)
/* Set and cleared by software.
   0: TIM10 clock disabled
   1: TIM10 clock enabled */

/* Bit 16 - TIM9 clock enable */
#define RCC_TIM9EN (1 << 16)
/* Set and cleared by software.
   0: TIM9 clock disabled
   1: TIM9 clock enabled */

/* Bit 14 - System configuration controller clock enable */
#define RCC_SYSCFGEN (1 << 14)
/* Set and cleared by software.
   0: System configuration controller clock disabled
   1: System configuration controller clock enabled */

/* Bit 12 - SPI1 clock enable */
#define RCC_SPI1EN (1 << 12)
/* Set and cleared by software.
   0: SPI1 clock disabled
   1: SPI1 clock enabled */

/* Bit 11 - SDIO clock enable */
#define RCC_SDIOEN (1 << 11)
/* Set and cleared by software.
   0: SDIO module clock disabled
   1: SDIO module clock enabled */

/* Bit 10 - ADC3 clock enable */
#define RCC_ADC3EN (1 << 10)
/* Set and cleared by software.
   0: ADC3 clock disabled
   1: ADC3 clock disabled */

/* Bit 9 - ADC2 clock enable */
#define RCC_ADC2EN (1 << 9)
/*      Set and cleared by software.
    0: ADC2 clock disabled
   1: ADC2 clock disabled */

/* Bit 8 - ADC1 clock enable */
#define RCC_ADC1EN (1 << 8)
/* Set and cleared by software.
   0: ADC1 clock disabled
   1: ADC1 clock disabled */

/* Bit 5 - USART6 clock enable */
#define RCC_USART6EN (1 << 5)
/* Set and cleared by software.
   0: USART6 clock disabled
   1: USART6 clock enabled */

/* Bit 4 - USART1 clock enable */
#define RCC_USART1EN (1 << 4)
/* Set and cleared by software.
   0: USART1 clock disabled
   1: USART1 clock enabled */

/* Bit 1 - TIM8 clock enable */
#define RCC_TIM8EN (1 << 1)
/* Set and cleared by software.
   0: TIM8 clock disabled
   1: TIM8 clock enabled */

/* Bit 0 - TIM1 clock enable */
#define RCC_TIM1EN (1 << 0)
/* Set and cleared by software.
   0: TIM1 clock disabled
   1: TIM1 clock enabled */

/* ------------------------------------------------------------------------- */
/* RCC AHB1 peripheral clock enable in low power mode register */
#define STM32F_RCC_AHB1LPENR 0x50

/* Bit 30 - USB OTG HS ULPI clock enable during Sleep mode */
#define RCC_OTGHSULPILPEN (1 << 30)
/* Set and cleared by software.
   0: USB OTG HS ULPI clock disabled during Sleep mode
   1: USB OTG HS ULPI clock enabled during Sleep mode */

/* Bit 29 - USB OTG HS clock enable during Sleep mode */
#define RCC_OTGHSLPEN (1 << 29)
/* Set and cleared by software.
   0: USB OTG HS clock disabled during Sleep mode
   1: USB OTG HS clock enabled during Sleep mode */

/* Bit 28 - Ethernet PTP clock enable during Sleep mode */
#define RCC_ETHMACPTPLPEN (1 << 28)
/* Set and cleared by software.
   0: Ethernet PTP clock disabled during Sleep mode
   1: Ethernet PTP clock enabled during Sleep mode */

/* Bit 27 - Ethernet reception clock enable during Sleep mode */
#define RCC_ETHMACRXLPEN (1 << 27)
/* Set and cleared by software.
   0: Ethernet reception clock disabled during Sleep mode
   1: Ethernet reception clock enabled during Sleep mode */

/* Bit 26 - Ethernet transmission clock enable during Sleep mode */
#define RCC_ETHMACTXLPEN (1 << 26)
/* Set and cleared by software.
   0: Ethernet transmission clock disabled during sleep mode
   1: Ethernet transmission clock enabled during sleep mode */

/* Bit 25 - Ethernet MAC clock enable during Sleep mode */
#define RCC_ETHMACLPEN (1 << 25)
/* Set and cleared by software.
   0: Ethernet MAC clock disabled during Sleep mode
   1: Ethernet MAC clock enabled during Sleep mode */

/* Bit 22 - DMA2 clock enable during Sleep mode */
#define RCC_DMA2LPEN (1 << 22)
/* Set and cleared by software.
   0: DMA2 clock disabled during Sleep mode
   1: DMA2 clock enabled during Sleep mode */

/* Bit 21 - DMA1 clock enable during Sleep mode */
#define RCC_DMA1LPEN (1 << 21)
/* Set and cleared by software.
   0: DMA1 clock disabled during Sleep mode
   1: DMA1 clock enabled during Sleep mode */

/* Bit 18 - Backup SRAM interface clock enable during Sleep mode */
#define RCC_BKPSRAMLPEN (1 << 18)
/* Set and cleared by software.
   0: Backup SRAM interface clock disabled during Sleep mode
   1: Backup SRAM interface clock enabled during Sleep mode */

/* Bit 17 - SRAM 2 interface clock enable during Sleep mode */
#define RCC_SRAM2LPEN (1 << 17)
/* Set and cleared by software.
   0: SRAM 2 interface clock disabled during Sleep mode
   1: SRAM 2 interface clock enabled during Sleep mode */

/* Bit 16 - SRAM 1interface clock enable during Sleep mode */
#define RCC_SRAM1LPEN (1 << 16)
/* Set and cleared by software.
   0: SRAM 1 interface clock disabled during Sleep mode
   1: SRAM 1 interface clock enabled during Sleep mode */

/* Bit 15 - Flash interface clock enable during Sleep mode */
#define RCC_FLITFLPEN (1 << 15)
/* Set and cleared by software.
   0: Flash interface clock disabled during Sleep mode
   1: Flash interface clock enabled during Sleep mode */

/* Bit 12 - CRC clock enable during Sleep mode */
#define RCC_CRCLPEN (1 << 12)
/* Set and cleared by software.
   0: CRC clock disabled during Sleep mode
   1: CRC clock enabled during Sleep mode */

/* Bit 8 - IO port I clock enable during Sleep mode */
#define RCC_GPIOILPEN (1 << 8)
/* Set and cleared by software.
   0: IO port I clock disabled during Sleep mode
   1: IO port I clock enabled during Sleep mode */ 

/* Bit 7 - IO port H clock enable during Sleep mode */
#define RCC_GPIOHLPEN (1 << 7)
/* Set and cleared by software.
   0: IO port H clock disabled during Sleep mode
   1: IO port H clock enabled during Sleep mode */

