bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 6 - IO port G clock enable during Sleep mode */
#define RCC_GPIOGLPEN (1 << 6)
/* Set and cleared by software.
   0: IO port G clock disabled during Sleep mode
   1: IO port G clock enabled during Sleep mode */

/* Bit 5 - IO port F clock enable during Sleep mode */
#define RCC_GPIOFLPEN (1 << 5)
/* Set and cleared by software.
   0: IO port F clock disabled during Sleep mode
   1: IO port F clock enabled during Sleep mode */

/* Bit 4 - IO port E clock enable during Sleep mode */
#define RCC_GPIOELPEN (1 << 4)
/* Set and cleared by software.
   0: IO port E clock disabled during Sleep mode
   1: IO port E clock enabled during Sleep mode */

/* Bit 3 - IO port D clock enable during Sleep mode */
#define RCC_GPIODLPEN (1 << 3)
/* Set and cleared by software.
   0: IO port D clock disabled during Sleep mode
   1: IO port D clock enabled during Sleep mode */

/* Bit 2 - IO port C clock enable during Sleep mode */
#define RCC_GPIOCLPEN (1 << 2)
/* Set and cleared by software.
   0: IO port C clock disabled during Sleep mode
   1: IO port C clock enabled during Sleep mode */

/* Bit 1 - IO port B clock enable during Sleep mode */
#define RCC_GPIOBLPEN (1 << 1)
/* Set and cleared by software.
   0: IO port B clock disabled during Sleep mode
   1: IO port B clock enabled during Sleep mode */

/* Bit 0 - IO port A clock enable during sleep mode */
#define RCC_GPIOALPEN (1 << 0)
/* Set and cleared by software.
   0: IO port A clock disabled during Sleep mode
   1: IO port A clock enabled during Sleep mode */

/* ------------------------------------------------------------------------- */
/* RCC AHB2 peripheral clock enable in low power mode register */
#define STM32F_RCC_AHB2LPENR 0x54

/* Bit 7 - USB OTG FS clock enable during Sleep mode */
#define RCC_OTGFSLPEN (1 << 7)
/* Set and cleared by software.
   0: USB OTG FS clock disabled during Sleep mode
   1: USB OTG FS clock enabled during Sleep mode */

/* Bit 6 - Random number generator clock enable during Sleep mode */
#define RCC_RNGLPEN (1 << 6)
/* Set and cleared by software.
   0: Random number generator clock disabled during Sleep mode
   1: Random number generator clock enabled during Sleep mode */

/* Bit 5 - Hash modules clock enable during Sleep mode */
#define RCC_HASHLPEN (1 << 5)
/* Set and cleared by software.
   0: Hash modules clock disabled during Sleep mode
   1: Hash modules clock enabled during Sleep mode */

/* Bit 4 - Cryptography modules clock enable during Sleep mode */
#define RCC_CRYPLPEN (1 << 4)
/* Set and cleared by software.
   0: cryptography modules clock disabled during Sleep mode
   1: cryptography modules clock enabled during Sleep mode */

/* Bit 0 - Camera interface enable during Sleep mode */
#define RCC_DCMILPEN (1 << 0)
/* Set and cleared by software.
   0: Camera interface clock disabled during Sleep mode
   1: Camera interface clock enabled during Sleep mode */


/* ------------------------------------------------------------------------- */
/* RCC AHB3 peripheral clock enable in low power mode register */
#define STM32F_RCC_AHB3LPENR 0x58

/* [31..1] Reserved, always read as 0. */

/* Flexible static memory controller module clock enable during Sleep mode */
#define RCC_FSMCLPEN (1 << 0)
/* Set and cleared by software.
   0: FSMC module clock disabled during Sleep mode
   1: FSMC module clock enabled during Sleep mode */

/* Bit 1 - QuadSPI memory controller module clock enable during Sleep mode */
#define RCC_QSPILPEN (1 << 0)
/* Set and cleared by software.
   0: QSPI module clock disabled during Sleep mode
   1: QSPI module clock enabled during Sleep mode */

/* ------------------------------------------------------------------------- */
/* RCC APB1 peripheral clock enable in low power mode register */
#define STM32F_RCC_APB1LPENR 0x60

/* Bit 29 - DAC interface clock enable during Sleep mode */
#define RCC_DACLPEN (1 << 29)
/* Set and cleared by software.
   0: DAC interface clock disabled during Sleep mode
   1: DAC interface clock enabled during Sleep mode */

/* Bit 28 - Power interface clock enable during Sleep mode */
#define RCC_PWRLPEN (1 << 28)
/* Set and cleared by software.
   0: Power interface clock disabled during Sleep mode 
   1: Power interface clock enabled during Sleep mode */

/* Bit 26 - CAN 2 clock enable during Sleep mode */
#define RCC_CAN2LPEN (1 << 26)
/* Set and cleared by software.
   0: CAN 2 clock disabled during sleep mode
   1: CAN 2 clock enabled during sleep mode */

/* Bit 25 - CAN 1 clock enable during Sleep mode */
#define RCC_CAN1LPEN (1 << 25)
/* Set and cleared by software.
   0: CAN 1 clock disabled during Sleep mode
   1: CAN 1 clock enabled during Sleep mode */

/* Bit 23 - I2C3 clock enable during Sleep mode */
#define RCC_I2C3LPEN (1 << 23)
/* Set and cleared by software.
   0: I2C3 clock disabled during Sleep mode
   1: I2C3 clock enabled during Sleep mode */

/* Bit 22 - I2C2 clock enable during Sleep mode */
#define RCC_I2C2LPEN (1 << 22)
/* Set and cleared by software.
   0: I2C2 clock disabled during Sleep mode
   1: I2C2 clock enabled during Sleep mode */

/* Bit 21 - I2C1 clock enable during Sleep mode */
#define RCC_I2C1LPEN (1 << 21)
/* Set and cleared by software.
   0: I2C1 clock disabled during Sleep mode
   1: I2C1 clock enabled during Sleep mode */

/* Bit 20 - UART5 clock enable during Sleep mode */
#define RCC_UART5LPEN (1 << 20)
/* Set and cleared by software.
   0: UART5 clock disabled during Sleep mode
   1: UART5 clock enabled during Sleep mode */

/* Bit 19 - UART4 clock enable during Sleep mode */
#define RCC_UART4LPEN (1 << 19)
/* Set and cleared by software.
   0: UART4 clock disabled during Sleep mode
   1: UART4 clock enabled during Sleep mode */

/* Bit 18 - USART3 clock enable during Sleep mode */
#define RCC_USART3LPEN (1 << 18)
/* Set and cleared by software.
   0: USART3 clock disabled during Sleep mode
   1: USART3 clock enabled during Sleep mode */

/* Bit 17 - USART2 clock enable during Sleep mode */
#define RCC_USART2LPEN (1 << 17)
/* Set and cleared by software.
   0: USART2 clock disabled during Sleep mode
   1: USART2 clock enabled during Sleep mode */

/* Bit 15 - SPI3 clock enable during Sleep mode */
#define RCC_SPI3LPEN (1 << 15)
/* Set and cleared by software.
   0: SPI3 clock disabled during Sleep mode
   1: SPI3 clock enabled during Sleep mode */

/* Bit 14 - SPI2 clock enable during Sleep mode */
#define RCC_SPI2LPEN (1 << 14)
/* Set and cleared by software.
   0: SPI2 clock disabled during Sleep mode
   1: SPI2 clock enabled during Sleep mode */

/* Bit 11 - Window watchdog clock enable during Sleep mode */
#define RCC_WWDGLPEN (1 << 11)
/* Set and cleared by software.
   0: Window watchdog clock disabled during sleep mode
   1: Window watchdog clock enabled during sleep mode */

