bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 8 - TIM14 clock enable during Sleep mode */
#define RCC_TIM14LPEN (1 << 8)
/* Set and cleared by software.
   0: TIM14 clock disabled during Sleep mode
   1: TIM14 clock enabled during Sleep mode */

/* Bit 7 - TIM13 clock enable during Sleep mode */
#define RCC_TIM13LPEN (1 << 7)
/* Set and cleared by software.
   0: TIM13 clock disabled during Sleep mode
   1: TIM13 clock enabled during Sleep mode */

/* Bit 6 - TIM12 clock enable during Sleep mode */
#define RCC_TIM12LPEN (1 << 6)
/* Set and cleared by software.
   0: TIM12 clock disabled during Sleep mode
   1: TIM12 clock enabled during Sleep mode */

/* Bit 5 - TIM7 clock enable during Sleep mode */
#define RCC_TIM7LPEN (1 << 5)
/* Set and cleared by software.
   0: TIM7 clock disabled during Sleep mode
   1: TIM7 clock enabled during Sleep mode */

/* Bit 4 - TIM6 clock enable during Sleep mode */
#define RCC_TIM6LPEN (1 << 4)
/* Set and cleared by software.
   0: TIM6 clock disabled during Sleep mode
   1: TIM6 clock enabled during Sleep mode */

/* Bit 3 - TIM5 clock enable during Sleep mode */
#define RCC_TIM5LPEN (1 << 3)
/* Set and cleared by software.
   0: TIM5 clock disabled during Sleep mode
   1: TIM5 clock enabled during Sleep mode */

/* Bit 2 - TIM4 clock enable during Sleep mode */
#define RCC_TIM4LPEN (1 << 2)
/* Set and cleared by software.
   0: TIM4 clock disabled during Sleep mode
   1: TIM4 clock enabled during Sleep mode */

/* Bit 1 - TIM3 clock enable during Sleep mode */
#define RCC_TIM3LPEN (1 << 1)
/* Set and cleared by software.
   0: TIM3 clock disabled during Sleep mode
   1: TIM3 clock enabled during Sleep mode */

/* Bit 0 - TIM2 clock enable during Sleep mode */
#define RCC_TIM2LPEN (1 << 0)
/* Set and cleared by software.
   0: TIM2 clock disabled during Sleep mode
   1: TIM2 clock enabled during Sleep mode */

/* ------------------------------------------------------------------------- */
/* RCC APB2 peripheral clock enabled in low power mode register */
#define STM32F_RCC_APB2LPENR 0x64

/* Bit 18 - TIM11 clock enable during Sleep mode */
#define RCC_TIM11LPEN (1 << 18)
/* Set and cleared by software.
   0: TIM11 clock disabled during Sleep mode
   1: TIM11 clock enabled during Sleep mode */

/* Bit 17 - TIM10 clock enable during Sleep mode */
#define RCC_TIM10LPEN (1 << 17)
/* Set and cleared by software.
   0: TIM10 clock disabled during Sleep mode
   1: TIM10 clock enabled during Sleep mode */

/* Bit 16 - TIM9 clock enable during sleep mode */
#define RCC_TIM9LPEN (1 << 16)
/* Set and cleared by software.
   0: TIM9 clock disabled during Sleep mode
   1: TIM9 clock enabled during Sleep mode */

/* Bit 14 - System configuration controller clock enable during Sleep mode */
#define RCC_SYSCFGLPEN (1 << 14)
/* Set and cleared by software.
   0: System configuration controller clock disabled during Sleep mode
   1: System configuration controller clock enabled during Sleep mode */

/* Bit 12 - SPI 1 clock enable during Sleep mode */
#define RCC_SPI1LPEN (1 << 12)
/* Set and cleared by software.
   0: SPI 1 clock disabled during Sleep mode
   1: SPI 1 clock enabled during Sleep mode */

/* Bit 11 - SDIO clock enable during Sleep mode */
#define RCC_SDIOLPEN (1 << 11)
/* Set and cleared by software.
   0: SDIO module clock disabled during Sleep mode
   1: SDIO module clock enabled during Sleep mode */

/* Bit 10 - ADC 3 clock enable during Sleep mode */
#define RCC_ADC3LPEN (1 << 10)
/* Set and cleared by software.
   0: ADC 3 clock disabled during Sleep mode
   1: ADC 3 clock disabled during Sleep mode */

/* Bit 9 - ADC2 clock enable during Sleep mode */
#define RCC_ADC2LPEN (1 << 9)
/* Set and cleared by software.
   0: ADC2 clock disabled during Sleep mode
   1: ADC2 clock disabled during Sleep mode */

/* Bit 8 - ADC1 clock enable during Sleep mode */
#define RCC_ADC1LPEN (1 << 8)
/* Set and cleared by software.
   0: ADC1 clock disabled during Sleep mode
   1: ADC1 clock disabled during Sleep mode */

/* Bit 5 - USART6 clock enable during Sleep mode */
#define RCC_USART6LPEN (1 << 5)
/* Set and cleared by software.
   0: USART6 clock disabled during Sleep mode
   1: USART6 clock enabled during Sleep mode */

/* Bit 4 - USART1 clock enable during Sleep mode */
#define RCC_USART1LPEN (1 << 4)
/* Set and cleared by software.
   0: USART1 clock disabled during Sleep mode
   1: USART1 clock enabled during Sleep mode */

/* Bit 1 - TIM8 clock enable during Sleep mode */
#define RCC_TIM8LPEN (1 << 1)
/* Set and cleared by software.
   0: TIM8 clock disabled during Sleep mode
   1: TIM8 clock enabled during Sleep mode */

/* Bit 0 - TIM1 clock enable during Sleep mode */
#define RCC_TIM1LPEN (1 << 0)
/* Set and cleared by software.
   0: TIM1 clock disabled during Sleep mode
   1: TIM1 clock enabled during Sleep mode */


/* ------------------------------------------------------------------------- */
/* RCC Backup domain control register */
#define STM32F_RCC_BDCR 0x70


/* Bit 16 - Backup domain software reset */
#define RCC_BDRST (1 << 16)
/* Set and cleared by software.
   0: Reset not activated
   1: Resets the entire Backup domain
   Note: The BKPSRAM is not affected by this reset, the only way of 
   resetting the BKPSRAM is through the Flash interface when a protection 
   level change from level 1 to level 0 is requested. */

/* Bit 15 - RTC clock enable */
#define RCC_RTCEN (1 << 15)
/* Set and cleared by software.
   0: RTC clock disabled
   1: RTC clock enabled */

/* Bits [9..8] - RTC clock source selection */
#define RCC_RTCSEL_MSK (((1 << (1 + 1)) - 1) << 8)
#define RCC_RTCSEL_SET(VAL) (((VAL) << 8) & RTCSEL_MSK)
#define RCC_RTCSEL_GET(REG) (((REG) & RTCSEL_MSK) >> 8)

#define RCC_RTCSEL_NONE (0 << 8)
#define RCC_RTCSEL_LSE  (1 << 8)
#define RCC_RTCSEL_LSI  (2 << 8)
#define RCC_RTCSEL_HSE  (3 << 8)

/* Set by software to select the clock source for the RTC. Once the RTC 
   clock source has been selected, it cannot be changed anymore unless the 
   Backup domain is reset. The BDRST bit can be used to reset them.
   00: No clock
   01: LSE oscillator clock used as the RTC clock
   10: LSI oscillator clock used as the RTC clock
   11: HSE oscillator clock divided by a programmable prescaler (selection 
   through the RTCPRE[4:0] bits in the RCC clock configuration register 
   (RCC_CFGR)) used as the RTC clock */

/* Bit 2 - External low-speed oscillator bypass */
#define RCC_LSEBYP (1 << 2)
/* Set and cleared by software to bypass oscillator in debug mode. This 
   bit can be written only when the LSE clock is disabled.
   0: LSE oscillator not bypassed
   1: LSE oscillator bypassed */

