bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 1 - External low-speed oscillator ready */
#define RCC_LSERDY (1 << 1)
/* Set and cleared by hardware to indicate when the external 32 kHz 
   oscillator is stable. After the LSEON bit is cleared, LSERDY goes low 
   after 6 external low-speed oscillator clock cycles.
   0: LSE clock not ready
   1: LSE clock ready */

/* Bit 0 - External low-speed oscillator enable */
#define RCC_LSEON (1 << 0)
/* Set and cleared by software.
   0: LSE clock OFF
   1: LSE clock ON */


/* ------------------------------------------------------------------------- */
/* RCC clock control & status register */
#define STM32F_RCC_CSR 0x74


/* Bit 31 - Low-power reset flag */
#define RCC_LPWRRSTF (1 << 31)
/* Set by hardware when a Low-power management reset occurs.
   Cleared by writing to the RMVF bit.
   0: No Low-power management reset occurred
   1: Low-power management reset occurred
   For further information on Low-power management reset, refer to 
   Low-power management reset. */

/* Bit 30 - Window watchdog reset flag */
#define RCC_WWDGRSTF (1 << 30)
/* Set by hardware when a window watchdog reset occurs.
   Cleared by writing to the RMVF bit.
   0: No window watchdog reset occurred
   1: Window watchdog reset occurred */

/* Bit 29 - Independent watchdog reset flag */
#define RCC_IWDGRSTF (1 << 29)
/* Set by hardware when an independent watchdog reset from VDD domain occurs.
   Cleared by writing to the RMVF bit.
   0: No watchdog reset occurred
   1: Watchdog reset occurred */

/* Bit 28 - Software reset flag */
#define RCC_SFTRSTF (1 << 28)
/* Set by hardware when a software reset occurs.
   Cleared by writing to the RMVF bit.
   0: No software reset occurred
   1: Software reset occurred */

/* Bit 27 - POR/PDR reset flag */
#define RCC_PORRSTF (1 << 27)
/* Set by hardware when a POR/PDR reset occurs.
   Cleared by writing to the RMVF bit.
   0: No POR/PDR reset occurred
   1: POR/PDR reset occurred */

/* Bit 26 - PIN reset flag */
#define RCC_PINRSTF (1 << 26)
/* Set by hardware when a reset from the NRST pin occurs.
   Cleared by writing to the RMVF bit.
   0: No reset from NRST pin occurred
   1: Reset from NRST pin occurred */

/* Bit 25 - BOR reset flag */
#define RCC_BORRSTF (1 << 25)
/* Cleared by software by writing the RMVF bit.
   Set by hardware when a POR/PDR or BOR reset occurs.
   0: No POR/PDR or BOR reset occurred
   1: POR/PDR or BOR reset occurred */

/* Bit 24 - Remove reset flag */
#define RCC_RMVF (1 << 24)
/* Set by software to clear the reset flags.
   0: No effect
   1: Clear the reset flags */

/* Bit 1 - Internal low-speed oscillator ready */
#define RCC_LSIRDY (1 << 1)
/* Set and cleared by hardware to indicate when the internal RC 40 kHz 
   oscillator is stable.
   After the LSION bit is cleared, LSIRDY goes low after 3 LSI clock cycles.
   0: LSI RC oscillator not ready
   1: LSI RC oscillator ready */

/* Bit 0 - Internal low-speed oscillator enable */
#define RCC_LSION (1 << 0)
/* Set and cleared by software.
   0: LSI RC oscillator OFF
   1: LSI RC oscillator ON */


/* ------------------------------------------------------------------------- */
/* RCC spread spectrum clock generation register */
#define STM32F_RCC_SSCGR 0x80


/* Bit 31 - Spread spectrum modulation enable */
#define RCC_SSCGEN (1 << 31)
/* Set and cleared by software.
   0: Spread spectrum modulation DISABLE. (To write after 
   clearing CR[24]=PLLON bit)
   1: Spread spectrum modulation ENABLE. (To write before 
   setting CR[24]=PLLON bit) */

/* Bit 30 - Spread Select */
#define RCC_SPREADSEL (1 << 30)
/* Set and cleared by software.
   To write before to set CR[24]=PLLON bit.
   0: Center spread
   1: Down spread */

/* Bits [27..13] - Incrementation step */
#define RCC_INCSTEP ((27 - 13) << 13)
/* Set and cleared by software. To write before setting CR[24]=PLLON bit.
   Configuration input for modulation profile amplitude. */

/* Bits [12..0] - Modulation period */
#define RCC_MODPER ((12 - 0) << 0)
/* Set and cleared by software. To write before setting CR[24]=PLLON bit.
   Configuration input for modulation profile period. */


/* ------------------------------------------------------------------------- */
/* RCC PLLI2S configuration register */
#define STM32F_RCC_PLLI2SCFGR 0x84


/* Bits [30..28] - PLLI2S division factor for I2S clocks */
#define RCC_PLLI2SR ((30 - 28) << 28)
/* Set and cleared by software to control the I2S clock frequency. These bits 
   should be written only if the PLLI2S is disabled. The factor must be 
   chosen in accordance with the prescaler values inside the I2S peripherals, 
   to reach 0.3% error when using standard crystals and 0% error with audio 
   crystals. For more information about I2S clock frequency and precision, 
   refer to Section 25.4.3: Clock generator in the I2S chapter.
   Caution: The I2Ss requires a frequency lower than or equal to 192 MHz 
   to work correctly.
   I2S clock frequency = VCO frequency / PLLR with 2 ≤ PLLR ≤ 7
   000: PLLR = 0, wrong configuration
   001: PLLR = 1, wrong configuration
   010: PLLR = 2
   ...
   111: PLLR = 7 */

/* [27..15] Reserved, always read as 0. */

/* Bits [14..6] - PLLI2S multiplication factor for VCO */
#define RCC_PLLI2SN ((14 - 6) << 6)
/* Set and cleared by software to control the multiplication factor 
   of the VCO. These bits can be written only when the PLLI2S is 
   disabled. Only half-word and word accesses are allowed to write 
   these bits.
   Caution: The software has to set these bits correctly to ensure that 
   the VCO output frequency is between 192 and 432 MHz.
   VCO output frequency = VCO input frequency × PLLI2SN with 
   192 ≤ PLLI2SN ≤ 432
   000000000: PLLI2SN = 0, wrong configuration
   000000001: PLLI2SN = 1, wrong configuration
   ...
   011000000: PLLI2SN = 192
   011000001: PLLI2SN = 193
   011000010: PLLI2SN = 194
   ...
   110110000: PLLI2SN = 432
   110110000: PLLI2SN = 433, wrong configuration
   ...
   111111111: PLLI2SN = 511, wrong configuration */

/* [5..0] Reserved, always read as 0. */


