bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
#endif /* STM32F2X */
/* ------------------------------------------------------------------------- */


/* ------------------------------------------------------------------------- */
#if defined(STM32F1X) || defined(STM32F3X)

/* ------------------------------------------------------------------------- */
/* Clock interrupt register */
#define STM32F_RCC_CIR 0x08

/* ------------------------------------------------------------------------- */
/* APB2 peripheral reset register */
#define STM32F_RCC_APB2RSTR 0x0c

/* ------------------------------------------------------------------------- */
/* APB1 peripheral reset register */
#define STM32F_RCC_APB1RSTR 0x10

/* ------------------------------------------------------------------------- */
/* AHB peripheral clock enable register */
#define STM32F_RCC_AHBENR 0x14

#if defined(STM32F3X)
#define RCC_ADC34 29
#define RCC_ADC12 28
#define RCC_TSC   24
#define RCC_IOPG  23
#define RCC_IOPF  22
#define RCC_IOPE  21
#define RCC_IOPD  20
#define RCC_IOPC  19
#define RCC_IOPB  18
#define RCC_IOPA  17
#define RCC_IOPH  16
#define RCC_CRC   6
#define RCC_FMC   5
#else
#define RCC_SDIO  10
#define RCC_FSMC  8
#define RCC_CRC   6
#endif
#define RCC_FLITF 4
#define RCC_SRAM  2
#define RCC_DMA2  1
#define RCC_DMA1  0

/* Bit 10 - SDIO clock enable */
#define RCC_SDIOEN (1 << 10)
/* 
Set and cleared by software.
0: SDIO clock disabled
1: SDIO clock enabled
Bits 9
Reserved, always read as 0. */

/* Bit 8 - FSMC clock enable */
#define RCC_FSMCEN (1 << 8)
/* 
Set and cleared by software.
0: FSMC clock disabled
1: FSMC clock enabled
Bit 7
Reserved, always read as 0. */

/* Bit 6 - CRC clock enable */
#define RCC_CRCEN (1 << 6)
/* 
Set and cleared by software.
0: CRC clock disabled
1: CRC clock enabled */

/* Bit 5 Reserved, must be kept at reset value. */


/* Bit 4 - FLITF clock enable */
#define RCC_FLITFEN (1 << 4)
/* 
Set and cleared by software to disable/enable FLITF clock during Sleep mode.
0: FLITF clock disabled during Sleep mode
1: FLITF clock enabled during Sleep mode */

/* Bit 3 Reserved, must be kept at reset value. */


/* Bit 2 - SRAM interface clock enable */
#define RCC_SRAMEN (1 << 2)
/* 
Set and cleared by software to disable/enable SRAM interface clock during Sleep mode.
0: SRAM interface clock disabled during Sleep mode.
1: SRAM interface clock enabled during Sleep mode */

/* Bit 1 - DMA2 clock enable */
#define RCC_DMA2EN (1 << 1)
/* 
Set and cleared by software.
0: DMA2 clock disabled
1: DMA2 clock enabled */

/* Bit 0 - DMA1 clock enable */
#define RCC_DMA1EN (1 << 0)
/* 
Set and cleared by software.
0: DMA1 clock disabled
1: DMA1 clock enabled */

/* APB2 peripheral clock enable register */
#define STM32F_RCC_APB2ENR 0x18

#define RCC_TIM17  18
#define RCC_TIM16  17
#define RCC_TIM15  16
#define RCC_USART1 14
#define RCC_TIM8   13
#define RCC_SPI1   12
#define RCC_TIM1   11

#if defined(STM32F3X)
#define RCC_TIM20  20
#define RCC_SPI4   15
#define RCC_SYSCFG  0
#endif

#if defined(STM32F1X) 
#define RCC_TIM11  21
#define RCC_TIM10  20
#define RCC_TIM9   19
#define RCC_ADC3   15
#define RCC_ADC2   10
#define RCC_ADC1    9
#define RCC_IOPG    8
#define RCC_IOPF    7
#define RCC_IOPE    6
#define RCC_IOPD    5
#define RCC_IOPC    4
#define RCC_IOPB    3
#define RCC_IOPA    2
#define RCC_AFIO    0
#endif

/* [31..22] Reserved, must be kept at reset value. */


/* Bit 21 - TIM11 timer clock enable */
#define RCC_TIM11EN (1 << 21)
/* Set and cleared by software.
   0: TIM11 timer clock disabled
   1: TIM11 timer clock enabled */

/* Bit 20 - TIM10 timer clock enable */
#define RCC_TIM10EN (1 << 20)
/* Set and cleared by software.
   0: TIM10 timer clock disabled
   1: TIM10 timer clock enabled */

/* Bit 19 - TIM9 timer clock enable */
#define RCC_TIM9EN (1 << 19)
/*  Set and cleared by software.
   0: TIM9 timer clock disabled
   1: TIM9 timer clock enabled */


/* Bit 18 - TIM17 timer clock enable */
#define RCC_TIM17EN (1 << 18)
/* Set and cleared by software.
   0: TIM17 timer clock disabled
   1: TIM17 timer clock enabled */

/* Bit 17 - TIM16 timer clock enable */
#define RCC_TIM16EN (1 << 17)
/* Set and cleared by software.
   0: TIM16 timer clock disabled
   1: TIM16 timer clock enabled */

/* Bit 16 - TIM15 timer clock enable */
#define RCC_TIM15EN (1 << 16)
/* Set and cleared by software.
   0: TIM15 timer clock disabled
   1: TIM15 timer clock enabled */


/* Bit 15 - ADC3 interface clock enable */
#define RCC_ADC3EN (1 << 15)
/* Set and cleared by software.
   0: ADC3 interface clock disabled
   1: ADC3 interface clock enabled */ 

/* Bit 14 - USART1 clock enable */
#define RCC_USART1EN (1 << 14)
/* Set and cleared by software.
   0: USART1 clock disabled
   1: USART1 clock enabled */

/* Bit 13 - TIM8 Timer clock enable */
#define RCC_TIM8EN (1 << 13)
/* Set and cleared by software.
   0: TIM8 timer clock disabled
   1: TIM8 timer clock enabled */

/* Bit 12 - SPI1 clock enable */
#define RCC_SPI1EN (1 << 12)
/* Set and cleared by software.
   0: SPI1 clock disabled
   1: SPI1 clock enabled */

/* Bit 11 - TIM1 timer clock enable */
#define RCC_TIM1EN (1 << 11)
/* 
Set and cleared by software.
0: TIM1 timer clock disabled
1: TIM1 timer clock enabled */

/* Bit 10 - ADC 2 interface clock enable */
#define RCC_ADC2EN (1 << 10)
/* 
Set and cleared by software.
0: ADC 2 interface clock disabled
1: ADC 2 interface clock enabled */

/* Bit 9 - ADC 1 interface clock enable */
#define RCC_ADC1EN (1 << 9)
/* 
Set and cleared by software.
0: ADC 1 interface disabled
1: ADC 1 interface clock enabled */

/* Bit 8 - IO port G clock enable */
#define RCC_IOPGEN (1 << 8)
/* 
Set and cleared by software.
0: IO port G clock disabled
1: IO port G clock enabled */

/* Bit 7 - IO port F clock enable */
#define RCC_IOPFEN (1 << 7)
/* 
Set and cleared by software.
0: IO port F clock disabled
1: IO port F clock enabled */

/* Bit 6 - IO port E clock enable */
#define RCC_IOPEEN (1 << 6)
/* 
Set and cleared by software.
0: IO port E clock disabled
1: IO port E clock enabled */

/* Bit 5 - IO port D clock enable */
#define RCC_IOPDEN (1 << 5)
/* 
Set and cleared by software.
0: IO port D clock disabled
1: IO port D clock enabled */

/* Bit 4 - IO port C clock enable */
#define RCC_IOPCEN (1 << 4)
/* 
Set and cleared by software.
0: IO port C clock disabled
1: IO port C clock enabled */

