bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 3 - IO port B clock enable */
#define RCC_IOPBEN (1 << 3)
/* 
Set and cleared by software.
0: IO port B clock disabled
1: IO port B clock enabled */

/* Bit 2 - IO port A clock enable */
#define RCC_IOPAEN (1 << 2)
/* 
Set and cleared by software.
0: IO port A clock disabled
1: IO port A clock enabled */

/* Bit 1 Reserved, must be kept at reset value. */

/* Bit 0 - Alternate function IO clock enable */
#define RCC_AFIOEN (1 << 0)
/* 
Set and cleared by software.
0: Alternate Function IO clock disabled
1: Alternate Function IO clock enabled */

/* APB1 peripheral clock enable register */
#define STM32F_RCC_APB1ENR 0x1c

#if defined(STM32F3X)
#define RCC_I2C3   30
#define RCC_DAC1   29
#define RCC_DAC2   26
#endif

#if defined(STM32F1X) 
#define RCC_CEC    30
#define RCC_DAC    29
#define RCC_BKP    27
#define RCC_TIM14   8
#define RCC_TIM13   7
#define RCC_TIM12   6
#define RCC_TIM5    3
#endif

#define RCC_PWR    28
#define RCC_CAN    25
#define RCC_USB    23
#define RCC_I2C2   22
#define RCC_I2C1   21
#define RCC_UART5  20
#define RCC_UART4  19
#define RCC_USART3 18
#define RCC_USART2 17
#define RCC_SPI3   15
#define RCC_SPI2   14
#define RCC_WWDG   11
#define RCC_TIM7    5
#define RCC_TIM6    4
#define RCC_TIM4    2
#define RCC_TIM3    1
#define RCC_TIM2    0

/* Bit 30 - CEC  clock enable */
#define RCC_CECEN (1 << 30)
/*
Set and cleared by software.
0: CEC  clock disabled
1: CEC  clock enable */

/* Bit 29 - DAC interface clock enable */
#define RCC_DACEN (1 << 29)
/* 
Set and cleared by software.
0: DAC interface clock disabled
1: DAC interface clock enable */

/* Bit 28 - Power interface clock enable */
#define RCC_PWREN (1 << 28)
/* 
Set and cleared by software.
0: Power interface clock disabled
1: Power interface clock enable */

/* Bit 27 - Backup interface clock enable */
#define RCC_BKPEN (1 << 27)
/* 
Set and cleared by software.
0: Backup interface clock disabled
1: Backup interface clock enabled */

/* Bit 26 Reserved, must be kept at reset value. */


/* Bit 25 - CAN clock enable */
#define RCC_CANEN (1 << 25)
/* 
Set and cleared by software.
0: CAN clock disabled
1: CAN clock enabled */

/* Bit 24 Reserved, always read as 0. */

/* Bit 23 - USB clock enable */
#define RCC_USBEN (1 << 23)
/* 
Set and cleared by software.
0: USB clock disabled
1: USB clock enabled */

/* Bit 22 - I2C2 clock enable */
#define RCC_I2C2EN (1 << 22)
/* 
Set and cleared by software.
0: I2C2 clock disabled
1: I2C2 clock enabled */

/* Bit 21 - I2C1 clock enable */
#define RCC_I2C1EN (1 << 21)
/* 
Set and cleared by software.
0: I2C1 clock disabled
1: I2C1 clock enabled */

/* Bit 20 - USART5 clock enable */
#define RCC_UART5EN (1 << 20)
/* 
Set and cleared by software.
0: USART5 clock disabled
1: USART5 clock enabled */

/* Bit 19 - USART4 clock enable */
#define RCC_UART4EN (1 << 19)
/* 
Set and cleared by software.
0: USART4 clock disabled
1: USART4 clock enabled */

/* Bit 18 - USART3 clock enable */
#define RCC_USART3EN (1 << 18)
/* 
Set and cleared by software.
0: USART3 clock disabled
1: USART3 clock enabled */

/* Bit 17 - USART2 clock enable */
#define RCC_USART2EN (1 << 17)
/* 
Set and cleared by software.
0: USART2 clock disabled
1: USART2 clock enabled */

/* Bit 16 Reserved, always read as 0. */

/* Bit 15 - SPI 3 clock enable */
#define RCC_SPI3EN (1 << 15)
/* 
Set and cleared by software.
0: SPI 3 clock disabled
1: SPI 3 clock enabled */

/* Bit 14 - SPI2 clock enable */
#define RCC_SPI2EN (1 << 14)
/* 
Set and cleared by software.
0: SPI2 clock disabled
1: SPI2 clock enabled */

/* [13..12] Reserved, must be kept at reset value. */

/* Bit 11 - Window watchdog clock enable */
#define RCC_WWDGEN (1 << 11)
/* 
Set and cleared by software.
0: Window watchdog clock disabled
1: Window watchdog clock enabled */

/* [10..9] Reserved, must be kept at reset value. */

/* Bit 8 - TIM14 timer clock enable */
#define RCC_TIM14EN (1 << 8)
/* 
Set and cleared by software.
0: TIM14 clock disabled
1: TIM14 clock enabled */

/* Bit 7 - TIM13 timer clock enable */
#define RCC_TIM13EN (1 << 7)
/* 
Set and cleared by software.
0: TIM13 clock disabled
1: TIM13 clock enabled */

/* Bit 6 - TIM12 timer clock enable */
#define RCC_TIM12EN (1 << 6)
/* 
Set and cleared by software.
0: TIM12 clock disabled
1: TIM12 clock enabled */

/* Bit 5 - TIM7 timer clock enable */
#define RCC_TIM7EN (1 << 5)
/* 
Set and cleared by software.
0: TIM7 clock disabled
1: TIM7 clock enabled */

/* Bit 4 - TIM6 timer clock enable */
#define RCC_TIM6EN (1 << 4)
/* 
Set and cleared by software.
0: TIM6 clock disabled
1: TIM6 clock enabled */

/* Bit 3 - TIM5 timer clock enable */
#define RCC_TIM5EN (1 << 3)
/* 
Set and cleared by software.
0: TIM5 clock disabled
1: TIM5 clock enabled */

/* Bit 2 - TIM4 timer clock enable */
#define RCC_TIM4EN (1 << 2)
/* 
Set and cleared by software.
0: TIM4 clock disabled
1: TIM4 clock enabled */

/* Bit 1 - TIM3 timer clock enable */
#define RCC_TIM3EN (1 << 1)
/* 
Set and cleared by software.
0: TIM3 clock disabled
1: TIM3 clock enabled */

/* Bit 0 - TIM2 timer clock enable */
#define RCC_TIM2EN (1 << 0)
/* 
Set and cleared by software.
0: TIM2 clock disabled
1: TIM2 clock enabled */

/* ------------------------------------------------------------------------- */
/* RCC Backup domain control register */
#define STM32F_RCC_BDCR 0x20

/* [31..17] Reserved, must be kept at reset value. */

/* Bit 16 - Backup domain software reset */
#define RCC_BDRST (1 << 16)
/* Set and cleared by software.
0: Reset not activated
1: Resets the entire Backup domain */

/* Bit 15 - RTC clock enable */
#define RCC_RTCEN (1 << 15)
/* Set and cleared by software.
0: RTC clock disabled
1: RTC clock enabled */

/* [14..10] Reserved, must be kept at reset value. */

/* Bits [9..8] - RTC clock source selection */
#define RCC_RTCSEL_MSK (((1 << (1 + 1)) - 1) << 8)
#define RCC_RTCSEL_SET(VAL) (((VAL) << 8) & RTCSEL_MSK)
#define RCC_RTCSEL_GET(REG) (((REG) & RTCSEL_MSK) >> 8)

#define RCC_RTCSEL_NONE (0 << 8)
#define RCC_RTCSEL_LSE  (1 << 8)
#define RCC_RTCSEL_LSI  (2 << 8)
#define RCC_RTCSEL_HSE  (3 << 8)

/* Set by software to select the clock source for the RTC. Once the RTC clock source has been
selected, it cannot be changed anymore unless the Backup domain is reset. The BDRST bit
can be used to reset them.
00: No clock
01: LSE oscillator clock used as RTC clock
10: LSI oscillator clock used as RTC clock
11: HSE oscillator clock divided by 32 used as RTC clock */

/* [7..5] Reserved, must be kept at reset value. */


/* Bits [4..3] - LSE oscillator drive capability */
#define RCC_LSEDRV ((4 - 3) << 3)
/* Set and reset by software to modulate the LSE oscillator’s drive 
   capability. A reset of the backup domain restores the default value.
   00: ‘Xtal mode’ lower driving capability
   01: ‘Xtal mode’ medium low driving capability
   10: ‘Xtal mode’ medium high driving capability
   11: ‘Xtal mode’ higher driving capability (reset value)
   Note: The oscillator is in Xtal mode when it is not in bypass mode. */

/* Bit 2 - LSE oscillator bypass */
#define RCC_LSEBYP (1 << 2)
/* Set and cleared by software to bypass oscillator in debug mode. This 
   bit can be written only when the external 32 kHz oscillator is disabled.
   0: LSE oscillator not bypassed
   1: LSE oscillator bypassed */

/* Bit 1 - LSE oscillator ready */
#define RCC_LSERDY (1 << 1)
/* Set and cleared by hardware to indicate when the external 32 kHz 
   oscillator is stable. After the LSEON bit is cleared, LSERDY goes low 
   after 6 external low-speed oscillator clock cycles.
   0: LSE oscillator not ready
   1: LSE oscillator ready */

