bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* Bit 0 - LSE oscillator enable */
#define RCC_LSEON (1 << 0)
/* Set and cleared by software.
   0: LSE oscillator OFF
   1: LSE oscillator ON */

/* ------------------------------------------------------------------------- */
/* Control/status register (RCC_CSR) */
#define STMF32_RCC_CSR 0x24

/* Bit 31 - Low-power reset flag */
#define RCC_LPWRSTF (1 << 31)
/* Set by hardware when a Low-power management reset occurs.
Cleared by writing to the RMVF bit.
0: No Low-power management reset occurred
1: Low-power management reset occurred
For further information on Low-power management reset, refer to Low-power management
reset. */

/* Bit 30 - Window watchdog reset flag */
#define RCC_WWDGRSTF (1 << 30)
/* Set by hardware when a window watchdog reset occurs.
Cleared by writing to the RMVF bit.
0: No window watchdog reset occurred
1: Window watchdog reset occurred */

/* Bit 29 - Independent window watchdog reset flag */
#define RCC_IWDGRSTF (1 << 29)
/* Set by hardware when an independent watchdog reset from VDD domain occurs.
Cleared by writing to the RMVF bit.
0: No watchdog reset occurred
1: Watchdog reset occurred */

/* Bit 28 - Software reset flag */
#define RCC_SFTRSTF (1 << 28)
/* Set by hardware when a software reset occurs.
Cleared by writing to the RMVF bit.
0: No software reset occurred
1: Software reset occurred */

/* Bit 27 - POR/PDR flag */
#define RCC_PORRSTF (1 << 27)
/* Set by hardware when a POR/PDR occurs.
Cleared by writing to the RMVF bit.
0: No POR/PDR occurred
1: POR/PDR occurred */

/* Bit 26 - PIN reset flag */
#define RCC_PINRSTF (1 << 26)
/* Set by hardware when a reset from the NRST pin occurs.
Cleared by writing to the RMVF bit.
0: No reset from NRST pin occurred
1: Reset from NRST pin occurred */

/* Bit 25 - Option byte loader reset flag */
#define RCC_OBLRSTF (1 << 25)
/* Set by hardware when a reset from the OBL occurs.
Cleared by writing to the RMVF bit.
0: No reset from OBL occurred
1: Reset from OBL occurred */

/* Bit 24 - Remove reset flag */
#define RCC_RMVF (1 << 24)
/* Set by software to clear the reset flags.
0: No effect
1: Clear the reset flags */

/* [23..2] Reserved, must be kept at reset value. */


/* Bit 1 - LSI oscillator ready */
#define RCC_LSIRDY (1 << 1)
/* Set and cleared by hardware to indicate when the LSI oscillator is stable. After the LSION bit
is cleared, LSIRDY goes low after 3 LSI oscillator clock cycles.
0: LSI oscillator not ready
1: LSI oscillator ready */

/* Bit 0 - LSI oscillator enable */
#define RCC_LSION (1 << 0)
/* Set and cleared by software.
0: LSI oscillator OFF
1: LSI oscillator ON */


/* ------------------------------------------------------------------------- */
/* AHB peripheral reset register (RCC_AHBRSTR) */
#define STMF32_RCC_AHBRSTR 0x28

/* [27..25] Reserved, must be kept at reset value. */


/* Bit 29 - ADC3 and ADC4 reset */
#define RCC_ADC34RST (1 << 29)
/* Set and reset by software.
0: does not reset the ADC3 and ADC4
1: resets the ADC3 and ADC4 */

/* Bit 28 - ADC1 and ADC2 reset */
#define RCC_ADC12RST (1 << 28)
/* Set and reset by software.
0: does not reset the ADC1 and ADC2
1: resets the ADC1 and ADC2 */

/* [27..25] Reserved, must be kept at reset value. */


/* Bit 24 - Touch sensing controller reset */
#define RCC_TSCRST (1 << 24)
/* Set and cleared by software.
0: No effect
1: Reset TSC */

/* Bit 23 Reserved, must be kept at reset value. */

/* Bit 22 - I/O port F reset */
#define RCC_IOPFRST (1 << 22)
/* Set and cleared by software.
0: No effect
1: Reset I/O port F */

/* Bit 21 - I/O port E reset */
#define RCC_OPERST (1 << 21)
/* Set and cleared by software.
0: No effect
1: Reset I/O port E */

/* Bit 20 - I/O port D reset */
#define RCC_IOPDRST (1 << 20)
/* Set and cleared by software.
0: No effect
1: Reset I/O port D */

/* Bit 19 - I/O port C reset */
#define RCC_IOPCRST (1 << 19)
/* Set and cleared by software.
0: No effect
1: Reset I/O port C */

/* Bit 18 - I/O port B reset */
#define RCC_IOPBRST (1 << 18)
/* Set and cleared by software.
0: No effect
1: Reset I/O port B */

/* Bit 17 - I/O port A reset */
#define RCC_IOPARST (1 << 17)
/* Set and cleared by software.
0: No effect
1: Reset I/O port A */

/* [16..0] Reserved, must be kept at reset value. */



/* ------------------------------------------------------------------------- */
/* Clock configuration register 2 (RCC_CFGR2) */
#define STMF32_RCC_CFGR2 0x2C

/* [31..14] Reserved, must be kept at reset value. */


/* Bits [13..9] - ADC34 prescaler */
#define RCC_ADC34PRES ((13 - 9) << 9)
/* Set and reset by software to control PLL clock to ADC34 division factor.
0xxxx: ADC34 clock disabled, ADC34 can use AHB clock
10000: PLL clock divided by 1
10001: PLL clock divided by 2
10010: PLL clock divided by 4
10011: PLL clock divided by 6
10100: PLL clock divided by 8
10101: PLL clock divided by 10
10110: PLL clock divided by 12
10111: PLL clock divided by 16
11000: PLL clock divided by 32
11001: PLL clock divided by 64
11010: PLL clock divided by 128
11011: PLL clock divided by 256
others: PLL clock divided by 256 */

/* Bits [8..4] - ADC prescaler */
#define RCC_ADC12PRES ((8 - 4) << 4)
/* Set and reset by software to control PLL clock to ADC12 division factor.
0xxxx: ADC12 clock disabled, ADC12 can use AHB clock
10000: PLL clock divided by 1
10001: PLL clock divided by 2
10010: PLL clock divided by 4
10011: PLL clock divided by 6
10100: PLL clock divided by 8
10101: PLL clock divided by 10
10110: PLL clock divided by 12
10111: PLL clock divided by 16
11000: PLL clock divided by 32
11001: PLL clock divided by 64
11010: PLL clock divided by 128
11011: PLL clock divided by 256
others: PLL clock divided by 256 */

/* Bits [3..0] - PREDIV division factor */
#define RCC_PREDIV_MSK (((1 << (3 + 1)) - 1) << 0)
#define RCC_PREDIV_SET(VAL) (((VAL) << 0) & PREDIV_MSK)
#define RCC_PREDIV_GET(REG) (((REG) & PREDIV_MSK) >> 0)
/* These bits are set and cleared by software to select PREDIV division factor. They can be
written only when the PLL is disabled.
Note: Bit 0 is the same bit as bit17 in Clock configuration register (RCC_CFGR), so modifying
bit17 Clock configuration register (RCC_CFGR) also modifies bit 0 in Clock
configuration register 2 (RCC_CFGR2) (for compatibility with other STM32 products)
0000: HSE input to PLL not divided
0001: HSE input to PLL divided by 2
0010: HSE input to PLL divided by 3
0011: HSE input to PLL divided by 4
0100: HSE input to PLL divided by 5
0101: HSE input to PLL divided by 6
0110: HSE input to PLL divided by 7
0111: HSE input to PLL divided by 8
1000: HSE input to PLL divided by 9
1001: HSE input to PLL divided by 10
1010: HSE input to PLL divided by 11
1011: HSE input to PLL divided by 12
1100: HSE input to PLL divided by 13
1101: HSE input to PLL divided by 14
1110: HSE input to PLL divided by 15
1111: HSE input to PLL divided by 16 */

#endif /* if defined(STM32F1X) || defined(STM32F3X) */

#if defined(STM32F3X)

/* ------------------------------------------------------------------------- */
/* Clock configuration register 3 (RCC_CFGR3) */
#define STMF32_RCC_CFGR3 0x30

