bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
/* [31..24] Reserved, must be kept at reset value. */


/* Bits [23..22] - UART5 clock source selection */
#define RCC_UART5SW_MSK (((1 << (1 + 1)) - 1) << 22)
#define RCC_UART5SW_SET(VAL) (((VAL) << 22) & UART5SW_MSK)
#define RCC_UART5SW_GET(REG) (((REG) & UART5SW_MSK) >> 22)
/* This bit is set and cleared by software to select the UART5 clock source.
00: PCLK selected as UART5 clock source (default)
01: System clock (SYSCLK) selected as UART5 clock
10: LSE clock selected as UART5 clock
11: HSI clock selected as UART5 clock */

/* Bits [21..20] - UART4 clock source selection */
#define RCC_UART4SW_MSK (((1 << (1 + 1)) - 1) << 20)
#define RCC_UART4SW_SET(VAL) (((VAL) << 20) & UART4SW_MSK)
#define RCC_UART4SW_GET(REG) (((REG) & UART4SW_MSK) >> 20)
/* This bit is set and cleared by software to select the UART4 clock source.
00: PCLK selected as UART4 clock source (default)
01: System clock (SYSCLK) selected as UART4 clock
10: LSE clock selected as UART4 clock
11: HSI clock selected as UART4 clock */

/* Bits [19..18] - USART3 clock source selection */
#define RCC_USART3SW_MSK (((1 << (1 + 1)) - 1) << 18)
#define RCC_USART3SW_SET(VAL) (((VAL) << 18) & USART3SW_MSK)
#define RCC_USART3SW_GET(REG) (((REG) & USART3SW_MSK) >> 18)
/* This bit is set and cleared by software to select the USART3 clock source.
00: PCLK selected as USART3 clock source (default)
01: System clock (SYSCLK) selected as USART3 clock
10: LSE clock selected as USART3 clock
11: HSI clock selected as USART3 clock */

/* Bits [17..16] - USART2 clock source selection */
#define RCC_USART2SW_MSK (((1 << (1 + 1)) - 1) << 16)
#define RCC_USART2SW_SET(VAL) (((VAL) << 16) & USART2SW_MSK)
#define RCC_USART2SW_GET(REG) (((REG) & USART2SW_MSK) >> 16)
/* This bit is set and cleared by software to select the USART2 clock source.
00: PCLK selected as USART2 clock source (default)
01: System clock (SYSCLK) selected as USART2 clock
10: LSE clock selected as USART2 clock
11: HSI clock selected as USART2 clock */

/* [15..10] Reserved, must be kept at reset value. */


/* Bit 9 - Timer8 clock source selection */
#define RCC_TIM8SW (1 << 9)
/* Set and reset by software to select TIM8 clock source.
The bit is writable only when the following conditions occur: clock system = PLL, and AHB
and APB2 subsystem clock not divided respect the clock system.
The bit is reset by hardware when exiting from the previous condition (user must set the bit
again in case of a new switch is required)
0: PCLK2 clock (doubled frequency when prescaled) (default)
1: PLL vco output (running up to 144 MHz) */

/* Bit 8 - Timer1 clock source selection */
#define RCC_TIM1SW (1 << 8)
/* Set and reset by software to select TIM1 clock source.
The bit is writable only when the following conditions occur: clock system = PLL, and AHB
and APB2 subsystem clock not divided respect the clock system.
The bit is reset by hardware when exiting from the previous condition (user must set the bit
again in case of a new switch is required)
0: PCLK2 clock (doubled frequency when prescaled) (default)
1: PLL vco output (running up to 144 MHz) */

/* [7..6] Reserved, must be kept at reset value. */


/* Bit 5 - I2C2 clock source selection */
#define RCC_I2C2SW (1 << 5)
/* This bit is set and cleared by software to select the I2C2 clock source.
0: HSI clock selected as I2C2 clock source (default)
1: PCLK clock selected as I2C2 clock */

/* Bit 4 - I2C1 clock source selection */
#define RCC_I2C1SW (1 << 4)
/* This bit is set and cleared by software to select the I2C1 clock source.
0: HSI clock selected as I2C1 clock source (default)
1: PCLK selected as I2C1 clock */

/* [3..2] Reserved, must be kept at reset value. */


/* Bits [1..0] - USART1 clock source selection */
#define RCC_USART1SW_MSK (((1 << (1 + 1)) - 1) << 0)
#define RCC_USART1SW_SET(VAL) (((VAL) << 0) & USART1SW_MSK)
#define RCC_USART1SW_GET(REG) (((REG) & USART1SW_MSK) >> 0)
/* This bit is set and cleared by software to select the USART1 clock source.
00: PCLK selected as USART1 clock source (default)
01: System clock (SYSCLK) selected as USART1 clock
10: LSE clock selected as USART1 clock
11: HSI clock selected as USART1 clock */

#endif /* defined(STM32F3X) */

#define STM32_AHB  0
#define STM32_AHB1 0
#define STM32_APB1 1
#define STM32_APB2 2
#define STM32_AHB2 3
#define STM32_AHB3 4

#if defined(STM32F2X) || defined(STM32F4X)

#define STM32_CLK_OTGHSULPI STM32_AHB1, RCC_OTGHSULPI
#define STM32_CLK_OTGHS     STM32_AHB1, RCC_OTGHS
#define STM32_CLK_ETHMACPTP STM32_AHB1, RCC_ETHMACPTP
#define STM32_CLK_ETHMACRX  STM32_AHB1, RCC_ETHMACRX
#define STM32_CLK_ETHMACTX  STM32_AHB1, RCC_ETHMACTX
#define STM32_CLK_ETHMAC    STM32_AHB1, RCC_ETHMAC
#define STM32_CLK_DMA2      STM32_AHB1, RCC_DMA2
#define STM32_CLK_DMA1      STM32_AHB1, RCC_DMA1
#define STM32_CLK_BKPSRAM   STM32_AHB1, RCC_BKPSRAM
#define STM32_CLK_CRC       STM32_AHB1, RCC_CRC
#define STM32_CLK_GPIOJ     STM32_AHB1, RCC_GPIOJ
#define STM32_CLK_GPIOI     STM32_AHB1, RCC_GPIOI
#define STM32_CLK_GPIOH     STM32_AHB1, RCC_GPIOH
#define STM32_CLK_GPIOG     STM32_AHB1, RCC_GPIOG
#define STM32_CLK_GPIOF     STM32_AHB1, RCC_GPIOF
#define STM32_CLK_GPIOE     STM32_AHB1, RCC_GPIOE
#define STM32_CLK_GPIOD     STM32_AHB1, RCC_GPIOD
#define STM32_CLK_GPIOC     STM32_AHB1, RCC_GPIOC
#define STM32_CLK_GPIOB     STM32_AHB1, RCC_GPIOB
#define STM32_CLK_GPIOA     STM32_AHB1, RCC_GPIOA

#define STM32_CLK_OTGFS     STM32_AHB2, RCC_OTGFS
#define STM32_CLK_RNG       STM32_AHB2, RCC_RNG
#define STM32_CLK_HASH      STM32_AHB2, RCC_HASH
#define STM32_CLK_CRYP      STM32_AHB2, RCC_CRYP
#define STM32_CLK_DCMI      STM32_AHB2, RCC_DCMI

#define STM32_CLK_QSPI      STM32_AHB3, RCC_QSPI
#define STM32_CLK_FSMC      STM32_AHB3, RCC_FSMC

#define STM32_CLK_UART8     STM32_APB1, RCC_UART8
#define STM32_CLK_UART7     STM32_APB1, RCC_UART7
#define STM32_CLK_DAC       STM32_APB1, RCC_DAC
#define STM32_CLK_PWR       STM32_APB1, RCC_PWR
#define STM32_CLK_CEC       STM32_APB1, RCC_CEC
#define STM32_CLK_CAN2      STM32_APB1, RCC_CAN2
#define STM32_CLK_CAN1      STM32_APB1, RCC_CAN1
#define STM32_CLK_FMPI2C1   STM32_APB1, RCC_FMPI2C1

#define STM32_CLK_I2C3      STM32_APB1, RCC_I2C3
#define STM32_CLK_I2C2      STM32_APB1, RCC_I2C2
#define STM32_CLK_I2C1      STM32_APB1, RCC_I2C1
#define STM32_CLK_UART5     STM32_APB1, RCC_UART5
#define STM32_CLK_UART4     STM32_APB1, RCC_UART4
#define STM32_CLK_USART3    STM32_APB1, RCC_USART3
#define STM32_CLK_USART2    STM32_APB1, RCC_USART2
#define STM32_CLK_SPI3      STM32_APB1, RCC_SPI3
#define STM32_CLK_SPI2      STM32_APB1, RCC_SPI2
#define STM32_CLK_WWDG      STM32_APB1, RCC_WWDG
#define STM32_CLK_TIM14     STM32_APB1, RCC_TIM14
#define STM32_CLK_TIM13     STM32_APB1, RCC_TIM13
#define STM32_CLK_TIM12     STM32_APB1, RCC_TIM12
#define STM32_CLK_TIM7      STM32_APB1, RCC_TIM7
#define STM32_CLK_TIM6      STM32_APB1, RCC_TIM6
#define STM32_CLK_TIM5      STM32_APB1, RCC_TIM5
#define STM32_CLK_TIM4      STM32_APB1, RCC_TIM4
#define STM32_CLK_TIM3      STM32_APB1, RCC_TIM3
#define STM32_CLK_TIM2      STM32_APB1, RCC_TIM2

#define STM32_CLK_LTDC      STM32_APB2, RCC_LTDC
#define STM32_CLK_SAI2      STM32_APB2, RCC_SAI2
#define STM32_CLK_SAI1      STM32_APB2, RCC_SAI1
#define STM32_CLK_SPI6      STM32_APB2, RCC_SPI6
#define STM32_CLK_SPI5      STM32_APB2, RCC_SPI5
#define STM32_CLK_TIM11     STM32_APB2, RCC_TIM11
#define STM32_CLK_TIM10     STM32_APB2, RCC_TIM10
#define STM32_CLK_TIM9      STM32_APB2, RCC_TIM9
#define STM32_CLK_SYSCFG    STM32_APB2, RCC_SYSCFG
#define STM32_CLK_SPI4      STM32_APB2, RCC_SPI4
#define STM32_CLK_SPI1      STM32_APB2, RCC_SPI1
#define STM32_CLK_SDIO      STM32_APB2, RCC_SDIO
#define STM32_CLK_ADC3      STM32_APB2, RCC_ADC3
#define STM32_CLK_ADC2      STM32_APB2, RCC_ADC2
#define STM32_CLK_ADC1      STM32_APB2, RCC_ADC1
#define STM32_CLK_USART6    STM32_APB2, RCC_USART6
#define STM32_CLK_USART1    STM32_APB2, RCC_USART1
#define STM32_CLK_TIM8      STM32_APB2, RCC_TIM8
#define STM32_CLK_TIM1      STM32_APB2, RCC_TIM1

#endif /* STM32F2X || STM32F4X  */


#if defined(STM32F1X) 

#define STM32_CLK_SDIO    STM32_AHB, RCC_SDIO
#define STM32_CLK_FSMC    STM32_AHB, RCC_FSMC
#define STM32_CLK_CRC     STM32_AHB, RCC_CRC
#define STM32_CLK_FLITF   STM32_AHB, RCC_FLITF
#define STM32_CLK_SRAM    STM32_AHB, RCC_SRAM
#define STM32_CLK_DMA2    STM32_AHB, RCC_DMA2
#define STM32_CLK_DMA1    STM32_AHB, RCC_DMA1

#define STM32_CLK_TIM11   STM32_APB2, RCC_TIM11
#define STM32_CLK_TIM10   STM32_APB2, RCC_TIM10
#define STM32_CLK_TIM9    STM32_APB2, RCC_TIM9
#define STM32_CLK_TIM17   STM32_APB2, RCC_TIM17
#define STM32_CLK_TIM16   STM32_APB2, RCC_TIM16
#define STM32_CLK_TIM15   STM32_APB2, RCC_TIM15
#define STM32_CLK_ADC3    STM32_APB2, RCC_ADC3
#define STM32_CLK_USART1  STM32_APB2, RCC_USART1
#define STM32_CLK_TIM8    STM32_APB2, RCC_TIM8
#define STM32_CLK_SPI1    STM32_APB2, RCC_SPI1
#define STM32_CLK_TIM1    STM32_APB2, RCC_TIM1
#define STM32_CLK_ADC2    STM32_APB2, RCC_ADC2
#define STM32_CLK_ADC1    STM32_APB2, RCC_ADC1
#define STM32_CLK_IOPG    STM32_APB2, RCC_IOPG
#define STM32_CLK_IOPF    STM32_APB2, RCC_IOPF
#define STM32_CLK_IOPE    STM32_APB2, RCC_IOPE
#define STM32_CLK_IOPD    STM32_APB2, RCC_IOPD
#define STM32_CLK_IOPC    STM32_APB2, RCC_IOPC
#define STM32_CLK_IOPB    STM32_APB2, RCC_IOPB
#define STM32_CLK_IOPA    STM32_APB2, RCC_IOPA
#define STM32_CLK_AFIO    STM32_APB2, RCC_AFIO

