bobmittmann/thinkos/sdk/include/stm32f/stm32f-rcc.h
#define STM32_CLK_GPIOG   STM32_APB2, RCC_IOPG
#define STM32_CLK_GPIOF   STM32_APB2, RCC_IOPF
#define STM32_CLK_GPIOE   STM32_APB2, RCC_IOPE
#define STM32_CLK_GPIOD   STM32_APB2, RCC_IOPD
#define STM32_CLK_GPIOC   STM32_APB2, RCC_IOPC
#define STM32_CLK_GPIOB   STM32_APB2, RCC_IOPB
#define STM32_CLK_GPIOA   STM32_APB2, RCC_IOPA

#define STM32_CLK_CEC     STM32_APB1, RCC_CEC
#define STM32_CLK_DAC     STM32_APB1, RCC_DAC
#define STM32_CLK_PWR     STM32_APB1, RCC_PWR
#define STM32_CLK_BKP     STM32_APB1, RCC_BKP
#define STM32_CLK_CAN     STM32_APB1, RCC_CAN
#define STM32_CLK_USB     STM32_APB1, RCC_USB
#define STM32_CLK_I2C2    STM32_APB1, RCC_I2C2
#define STM32_CLK_I2C1    STM32_APB1, RCC_I2C1
#define STM32_CLK_UART5   STM32_APB1, RCC_UART5
#define STM32_CLK_UART4   STM32_APB1, RCC_UART4
#define STM32_CLK_USART3  STM32_APB1, RCC_USART3
#define STM32_CLK_USART2  STM32_APB1, RCC_USART2
#define STM32_CLK_SPI3    STM32_APB1, RCC_SPI3
#define STM32_CLK_SPI2    STM32_APB1, RCC_SPI2
#define STM32_CLK_WWDG    STM32_APB1, RCC_WWDG
#define STM32_CLK_TIM14   STM32_APB1, RCC_TIM14
#define STM32_CLK_TIM13   STM32_APB1, RCC_TIM13
#define STM32_CLK_TIM12   STM32_APB1, RCC_TIM12
#define STM32_CLK_TIM7    STM32_APB1, RCC_TIM7
#define STM32_CLK_TIM6    STM32_APB1, RCC_TIM6
#define STM32_CLK_TIM5    STM32_APB1, RCC_TIM5
#define STM32_CLK_TIM4    STM32_APB1, RCC_TIM4
#define STM32_CLK_TIM3    STM32_APB1, RCC_TIM3
#define STM32_CLK_TIM2    STM32_APB1, RCC_TIM2

#endif /* STM32F1X */


#if defined(STM32F3X)

#define STM32_CLK_ADC34   STM32_AHB, RCC_ADC34
#define STM32_CLK_ADC12   STM32_AHB, RCC_ADC12
#define STM32_CLK_TSC     STM32_AHB, RCC_TSC
#define STM32_CLK_IOPG    STM32_AHB, RCC_IOPG
#define STM32_CLK_IOPF    STM32_AHB, RCC_IOPF
#define STM32_CLK_IOPE    STM32_AHB, RCC_IOPE
#define STM32_CLK_IOPD    STM32_AHB, RCC_IOPD
#define STM32_CLK_IOPC    STM32_AHB, RCC_IOPC
#define STM32_CLK_IOPB    STM32_AHB, RCC_IOPB
#define STM32_CLK_IOPA    STM32_AHB, RCC_IOPA
#define STM32_CLK_IOPH    STM32_AHB, RCC_IOPH
#define STM32_CLK_CRC     STM32_AHB, RCC_CRC
#define STM32_CLK_FMC     STM32_AHB, RCC_FMC
#define STM32_CLK_FLITF   STM32_AHB, RCC_FLITF
#define STM32_CLK_SRAM    STM32_AHB, RCC_SRAM
#define STM32_CLK_DMA2    STM32_AHB, RCC_DMA2
#define STM32_CLK_DMA1    STM32_AHB, RCC_DMA1

#define STM32_CLK_GPIOG   STM32_AHB, RCC_IOPG
#define STM32_CLK_GPIOF   STM32_AHB, RCC_IOPF
#define STM32_CLK_GPIOE   STM32_AHB, RCC_IOPE
#define STM32_CLK_GPIOD   STM32_AHB, RCC_IOPD
#define STM32_CLK_GPIOC   STM32_AHB, RCC_IOPC
#define STM32_CLK_GPIOB   STM32_AHB, RCC_IOPB
#define STM32_CLK_GPIOA   STM32_AHB, RCC_IOPA

#define STM32_CLK_TIM20   STM32_APB2, RCC_TIM20
#define STM32_CLK_TIM17   STM32_APB2, RCC_TIM17
#define STM32_CLK_TIM16   STM32_APB2, RCC_TIM16
#define STM32_CLK_TIM15   STM32_APB2, RCC_TIM15
#define STM32_CLK_SPI4    STM32_APB2, RCC_SPI4
#define STM32_CLK_USART1  STM32_APB2, RCC_USART1
#define STM32_CLK_TIM8    STM32_APB2, RCC_TIM8
#define STM32_CLK_SPI1    STM32_APB2, RCC_SPI1
#define STM32_CLK_TIM1    STM32_APB2, RCC_TIM1
#define STM32_CLK_SYSCFG  STM32_APB2, RCC_SYSCFG

#define STM32_CLK_I2C3    STM32_APB1, RCC_I2C3
#define STM32_CLK_DAC     STM32_APB1, RCC_DAC1
#define STM32_CLK_PWR     STM32_APB1, RCC_PWR
#define STM32_CLK_BKP     STM32_APB1, RCC_DAC2
#define STM32_CLK_CAN     STM32_APB1, RCC_CAN
#define STM32_CLK_USB     STM32_APB1, RCC_USB
#define STM32_CLK_I2C2    STM32_APB1, RCC_I2C2
#define STM32_CLK_I2C1    STM32_APB1, RCC_I2C1
#define STM32_CLK_UART5   STM32_APB1, RCC_UART5
#define STM32_CLK_UART4   STM32_APB1, RCC_UART4
#define STM32_CLK_USART3  STM32_APB1, RCC_USART3
#define STM32_CLK_USART2  STM32_APB1, RCC_USART2
#define STM32_CLK_SPI3    STM32_APB1, RCC_SPI3
#define STM32_CLK_SPI2    STM32_APB1, RCC_SPI2
#define STM32_CLK_WWDG    STM32_APB1, RCC_WWDG
#define STM32_CLK_TIM7    STM32_APB1, RCC_TIM7
#define STM32_CLK_TIM6    STM32_APB1, RCC_TIM6
#define STM32_CLK_TIM4    STM32_APB1, RCC_TIM4
#define STM32_CLK_TIM3    STM32_APB1, RCC_TIM3
#define STM32_CLK_TIM2    STM32_APB1, RCC_TIM2

#endif /* STM32F3X */

#define CLK_BUS(_BUS, _BIT) _BUS
#define CLK_BIT(_BUS, _BIT) _BIT

#ifndef __ASSEMBLER__

#include <stdint.h>

#if defined(STM32F2X) || defined(STM32F4X)
struct stm32_rcc {
	volatile uint32_t cr; /* Control Register */
	volatile uint32_t pllcfgr; 
	volatile uint32_t cfgr; 
	volatile uint32_t cir; 

	volatile uint32_t ahb1rstr;
	volatile uint32_t ahb2rstr;
	volatile uint32_t ahb3rstr;
	uint32_t res0; 

	volatile uint32_t apb1rstr;
	volatile uint32_t apb2rstr;
	uint32_t res1[2]; 

	volatile uint32_t ahb1enr;
	volatile uint32_t ahb2enr;
	volatile uint32_t ahb3enr;
	uint32_t res2; 

	volatile uint32_t apb1enr;
	volatile uint32_t apb2enr;
	uint32_t res3[2]; 

	volatile uint32_t ahb1lpenr;
	volatile uint32_t ahb2lpenr; 
	volatile uint32_t ahb3lpenr;
	uint32_t res4; 

	volatile uint32_t apb1lpenr;
	volatile uint32_t apb2lpenr;
	uint32_t res5[2]; 

	volatile uint32_t bdcr;
	volatile uint32_t csr;
	uint32_t res6[2]; 

	volatile uint32_t sscgr;
	volatile uint32_t plli2scfgr;
};

#endif /* STM32F2X || STM32F4X  */

#if defined(STM32F1X) || defined(STM32F3X)
struct stm32_rcc {
	volatile uint32_t cr; /* Control Register */
	volatile uint32_t cfgr; 
	volatile uint32_t cir; 
	volatile uint32_t apb2rstr;

	volatile uint32_t apb1rstr;
	volatile uint32_t ahbenr;
	volatile uint32_t apb2enr;
	volatile uint32_t apb1enr;

	volatile uint32_t bdcr;
	volatile uint32_t csr;
	volatile uint32_t ahbrstr;
	volatile uint32_t cfgr2; 
#if defined(STM32F3X)
	volatile uint32_t cfgr3; 
#endif
};
#endif /* STM32F1X || STM32F3X */

struct stm32_clk {
	uint8_t bus:3;
	uint8_t bit:5;
} __attribute__((packed))__;

extern const uint32_t stm32f_apb1_hz;
extern const uint32_t stm32f_apb2_hz;
extern const uint32_t stm32f_ahb_hz;
extern const uint32_t stm32f_tim2_hz;
extern const uint32_t stm32f_tim1_hz;
extern const uint32_t stm32f_hsi_hz;

#ifdef __cplusplus
extern "C" {
#endif

static inline void stm32_clk_enable(struct stm32_rcc * rcc, 
									int bus, int bit) {
	if (bus == STM32_APB2)
		rcc->apb2enr |= 1 << bit;
	else if (bus == STM32_APB1)
		rcc->apb1enr |= 1 << bit;
#if defined(STM32F1X) || defined(STM32F3X)
	else
		rcc->ahbenr |= 1 << bit;
#else
	else if (bus == STM32_AHB2)
		rcc->ahb2enr |= 1 << bit;
	else if (bus == STM32_AHB3)
		rcc->ahb3enr |= 1 << bit;
	else
		rcc->ahb1enr |= 1 << bit;
#endif
	asm volatile ("dsb" : );
}

static inline void stm32_clk_disable(struct stm32_rcc * rcc, 
									 int bus, int bit) {
	if (bus == STM32_APB2)
		rcc->apb2enr &= ~(1 << bit);
	else if (bus == STM32_APB1)
		rcc->apb1enr &= ~(1 << bit);
#if defined(STM32F1X) || defined(STM32F3X)
	else
		rcc->ahbenr &= ~(1 << bit);
#else
	else if (bus == STM32_AHB2)
		rcc->ahb2enr &= ~(1 << bit);
	else if (bus == STM32_AHB3)
		rcc->ahb3enr &= ~(1 << bit);
	else
		rcc->ahb1enr &= ~(1 << bit);
#endif
}

static inline uint32_t stm32_clk_hz(int bus, int bit) {
	if (bus == STM32_APB2)
		return stm32f_apb2_hz;
	if (bus == STM32_APB1)
		return stm32f_apb1_hz;
	return stm32f_ahb_hz;
}

#ifdef __cplusplus
}
#endif
#endif /* __ASSEMBLER__ */

#endif /* __STM32F_RCC_H__ */

